[
    {
        "reviewer_name": "Gayathri Arun",
        "period": "2 weeks ago",
        "review": "We had to admit our son for a week in Gem Perungudi for hepatitis ADr.Babu Narayanan was the consultant, such an experienced physician with a wealth of experience and knowledge who is very approachableDr.Ahim the junior consultant is very knowledgeable, and makes sure realistic updates on the prognosis is provided to the patients and clears the doubts with utmost patienceThank you doctors for your support through our toughest timesThe MG team was very supportive throughout the courseNursing staff are truly a feather to the cap such care and hospitality that makes us feel well (Spl mention Vanaja sister)The administrative staff are well equipped and regularly visit to know the conveniencesWe opted for room 612 and it was very spacious and well lit , very well maintainedThere are dietitians who monitor the food and also provide in house if requiredIt’s one of the hospitals which ticks every box for the best care in the city"
    },
    {
        "reviewer_name": "Nisha Dinesh",
        "period": "5 months ago",
        "review": "My husband had been suffering from gastric issues for a week, visited Gem Hospital when it didn't settle.Initially met Dr.Rajendraprasad sir with his reference on opinion with Dr. Pinak Das, he had performed laproscopy gallbladder surgery . Doctor gave us clear information and guidance throughout the process. The PRO team and kowsalya helped us to clear every doubts. Treatment is good with room and every facilities and now he is recovering.Thank you Dr. Pinak sir and their team🙏🙏"
    },
    {
        "reviewer_name": "nathan67917",
        "period": "a month ago",
        "review": "Respected Doctor Senthilnathan sirI would like to express my heartfelt gratitude to Dr. Senthilnath P Surgeon gastroenterologist, his team of doctors, PRO Prathipa ma’am, ER staffs, ICU staffs and the entire nursing staff at GEM Hospital, Chennai, for the exceptional care provided to my wife, Mrs. Rajalekshmi, age 36 years old during her treatment for a major, complicated gallbladder surgery and post surgery care.From the beginning, Dr. Senthilnathan sir exhibited not only his unmatched expertise but also a compassionate approach to patient care. The manner in which he addressed her complex health issues, explained her condition with clarity, and guided us through every step of the treatment has been truly remarkable. His calm demeanor, clear communication, and thoughtful approach gave us immense confidence and reassured my wife during this challenging period.Despite initial advice from a reputed international hospital in Porur for an open surgery, Dr. Senthilnathan sir successfully performed the procedure laparoscopically, showcasing his exceptional proficiency in minimally invasive surgery. My wife recovered remarkably well, walking back home within a week without any complications—an outcome that far exceeded our expectations.I am particularly grateful for the time and personal attention Dr. Senthilnathan sir continues to invest in her care, despite his demanding schedule. His tireless commitment to ensuring her well-being and recovery has been a great source of relief and comfort for our family. His reassurance and compassionate care have had a profound impact on her emotional and physical health, giving us the strength and hope to face each day.The environment at GEM Hospital further amplified this positive experience. The facility was impeccably clean, and the welcoming, patient-friendly atmosphere was a stark contrast to the typical hospital environment. This greatly contributed to my wife’s comfort and overall well-being during her stay.I wholeheartedly recommend GEM Hospital, Chennai, and Dr. Senthilnathan P. Surgeon gastroenterologist for anyone seeking advanced and compassionate care for gastroenterology-related treatments. Their dedication to patient care and medical excellence is truly commendable.Thank you once again, Dr. Senthilnathan, sir and the entire team at GEM Hospital, for setting a benchmark in medical care and ensuring such a seamless experience for my family. We are fortunate to have a doctor like you and remain grateful for the exceptional comfort and quality of care you continue to provide . As a member of the uniformed service, I am trained to recognize excellence and precision. I extend my heartfelt gratitude and a big salute to you for the successful laparoscopic surgery. God bless you sir ."
    },
    {
        "reviewer_name": "ceenvee 8686",
        "period": "3 months ago",
        "review": "Recently I visited to the GEM Hospital for my Umblical Hernia problem. From the moment I arrived, The doctor Mr.Pinak sir team (Mr.Ajay) and medical team Ms.Kowsalya (PRO) were thorough in explaining my condition and the treatment options available, which gave me great confidence. The nurses and support staff were attentive, ensuring I was comfortable throughout the process.I would like to thank everyone at GEM Hospital for their dedication to patient care, and I highly recommend this facility to anyone seeking medical assistance. I deeply appreciate the attention and care I received, and I feel much better now thanks to your team's efforts"
    },
    {
        "reviewer_name": "VIGNESH MURUGAJOTHI",
        "period": "4 months ago",
        "review": "Overall experience was good but the waiting time must be improved. Overall treatment is good. The services were good and the staff and doctors were excellent in all ways.Doctors\"\"The care I received from Doctors was exceptional. They listened attentively to my concerns and provided personalized treatment that yielded positive results\"\". \"\"I did not have to wait long at all for the doctor. The doctor was very friendly and thorough. he listened and answered my questions\"\"."
    },
    {
        "reviewer_name": "Gayathri S",
        "period": "a month ago",
        "review": "Good and the service was good.all the staffs treated us with family oriented way of approach. Good doctors and the way of communicating and caring too satisfied. Would recommend for any one to come to gem hospital for your problems would be cleared and will lead a healthy life. Would recommend 5 star rating thanks to the team."
    },
    {
        "reviewer_name": "vijayasarathi g",
        "period": "3 weeks ago",
        "review": "I recently underwent surgery at Gem Hospital, and I had the privilege of being treated by Dr. SreeRam. He is an excellent doctor who explained the entire process clearly, which helped me feel confident and well-prepared. His professionalism and supportive nature were truly reassuring.The hospital facilities were top-notch, and the entire staff was exceptionally professional, friendly, and supportive throughout my stay. They ensured that I was comfortable and well taken care of at all times.I would highly recommend Dr. SreeRam and Gem Hospital for anyone seeking high-quality medical care. A heartfelt thank you to the entire team!"
    },
    {
        "reviewer_name": "Abhinesh Saranath",
        "period": "2 months ago",
        "review": "I’m incredibly grateful for the wonderful care I received at Gem Hospital. Dr. P.Senthilnathan and all the Nurse from ICU to General ward went above and beyond to make sure I was comfortable and informed at every step. The team was thorough in their care, explained each step of my treatment clearly, and were always available to answer my questions. The hospital was spotless, the facilities were modern, and the admission process was smooth and efficient. The compassion and support from the entire staff made a difficult time much more manageable."
    },
    {
        "reviewer_name": "DHANUSHA SRINIVASAN",
        "period": "a month ago",
        "review": "Really recommended. Very kind and supportive staffs and doctors . Incredible service. They didn’t even panic us by saying any negative words even when we are really upset and scared . Really motivated and gave very polite and positive words and really treated so quick and fast. Really best ever service provided. No one was harsh . Even when we are talking little harsh they just calm us and give positivity. Best ever service and hospital ever🙏🏻"
    },
    {
        "reviewer_name": "Thooriga Velan",
        "period": "a week ago",
        "review": "writing a thankful feedback to gem hospital staffs,  they are  express ,gratitude for their care, dedication, and commitment to patient well-being. I went the hospital for UTI problem hspt staff Dr.senthilnathan sir was so kind of me ... Next day I was went for my further move about uTi it's was clear and they Doctor are prescribed medicine it is good!!!! Through out the help of Pharmacy Gopinath sir thank you for u r kindness and hospitalisation ❤️"
    },
    {
        "reviewer_name": "Vigneshwer babu",
        "period": "a month ago",
        "review": "My wife had a laparoscopic surgery for gall bladder removal. The hospital was so organized and nurses and Doctors were kind enough to explain the case. Food were of very high quality and provided on timely manner. Canteen inside hospital premises serves as premium restaurant with economic price. Overall satisfied with GEM hospital service"
    },
    {
        "reviewer_name": "praveen nathan",
        "period": "2 weeks ago",
        "review": "Best hospital for complex Hernia and laproscopy. Dr. Pinak Dasgupta is very best. He and his team has done excellent job for my wife complex Hernia surgery with full adbominal wall reconstruction via laproscopy. If there is hernia, go for Gem hospital for best service and hospitality.. Neat rooms and valued service from nurse.Insurance department: The best person to go for insurance query is Saranya madam. She knows in and out about dealing with insurance.. Kudos to Saranya madam in insurance department!!"
    },
    {
        "reviewer_name": "Senthil C",
        "period": "6 days ago",
        "review": "I did comprehensive health checkup here, its completely good, especially doctors are good not rushing us, their explanations are quite clear and good, and the attender Bharathi Parameshwari took care of everything for each and every tests. It's impressive a year back i came for my wife now for me, still they care the same"
    },
    {
        "reviewer_name": "Joseph Ajay",
        "period": "a month ago",
        "review": "All staffs are really good. Very attentive to all the patients.  Like care wise and all. Too humble doctors and staffs. kind to everyone even when they just came for enquiry. I personally appreciate the front office staffs and nursing and house keeping staffs. They greeting everyone with warm and smiling  face. 👌🏻 Especially Bhuvana from front office. It’s fun to have conversations with her. Really entertaining."
    },
    {
        "reviewer_name": "INDUMATHI SIVAKUMAR",
        "period": "a month ago",
        "review": "This rating is for Dr Nandhini. She is really awesome. I was carried away by the way she explained the issue and she ensured that anybody can understand. She is very confident and a bold doctor. She suggested me some better treatment options which I had not known earlier."
    },
    {
        "reviewer_name": "Kavitha",
        "period": "3 weeks ago",
        "review": "We consulted Dr. Nandhini mam for my surgery. She treated me well ans she was very expertise. Gem hospital provided a excellent care and treatment. The patient care is very good. Nurses and other staffs are very helpful and take care me well. And i need to special thanks to Rashika PRO who take cares me well from my whole journey in the gem hospital. Iam very satisfied with her service and by the whole team. Thank you gem"
    },
    {
        "reviewer_name": "Rizwan Noor",
        "period": "5 months ago",
        "review": "We really appreciate the service provided by Each and everyone in the hospital.Dr. Senthilnathan sir words and gesture itself take us to very comfort zone and reduce our worries. Also his team and all nurses were also very kind ,supportive and very attentive always. Patients Food and guest food was very good and affordable.Cleanliness was very good.Really appreciate the great team work"
    },
    {
        "reviewer_name": "Manohar Kota",
        "period": "3 weeks ago",
        "review": "An excellent place to address all gastric-related issues. Dr. Umasankar is an outstanding doctor and a very calm person. He accurately identified my problems and provided an effective solution. Thank you so much, sir!"
    },
    {
        "reviewer_name": "SUJATHA M",
        "period": "4 months ago",
        "review": "I was recently admitted to Gem Hospital for dengue fever and had a great experience with the dietitian team! They provided excellent care and guidance on my dietary needs during my recovery. The personalized attention and support helped me feel better soon. Special thanks to the Dr.Jayanth for his kindness, professionalism, and dedication. I highly recommend Gem Hospital for their exceptional service"
    },
    {
        "reviewer_name": "Ramesh Shanmugam",
        "period": "2 months ago",
        "review": "Excellent service by all support staff, nurses, doctors. Expert doctors, very friendly and empathetic. My wife surgery was performed by Dr. Delphine Supriya she’s very experienced, friendly and surgery was performed without much difficulties. Also, the PRO Ms.Rashika was very helpful, timely support."
    },
    {
        "reviewer_name": "Sethy Prad",
        "period": "3 months ago",
        "review": "Good services was provided from the gem hospital. All staff and nurses are so much kind during the treatment. Frequently ensuring the patients comfort and doing the needful.Dr.Delphin mam was so kind and cleared all my doubt, Thank you so much for taking care during my surgery. I have scared a lot. And I need to thank Rashika PRO for her excellent guidance which made me feel confident and better for my recovery and for the stay in the hospital . Thank you so much gem hospital"
    },
    {
        "reviewer_name": "Vinoth Xavier",
        "period": "6 months ago",
        "review": "My mother underwent surgery to repair a hernia last week.. The service they provided was too Good. The level of care and treatment provided surpassed our expectations. The equipment, along with the highly skilled staff, ensured that we received the best possible care. Dr. Srinivaasan gave a good treatment and he is very polite and explained everything clearly before the surgery. I would like to express our heartfelt gratitude to the entire team at Gem Hospital"
    },
    {
        "reviewer_name": "SWAMINATHAN GANESAN",
        "period": "2 months ago",
        "review": "Amazing experience. I didn't feel that I was in a hospital.  Dr. P. Senthilnathan's polite approach and the way he explained the scan report is phenomenal.  The way he gave confidence is unforgettable. I need to mention Miss Smitha, at Reception , for her extraordinary care taken during registration."
    },
    {
        "reviewer_name": "THANGAPANDI SUBBIAH",
        "period": "3 months ago",
        "review": "Dear Dr.Yuvaraj [UROLOGY],I hope this message reaches you in good health. I am writing to express my heartfelt gratitude for the exceptional care you provided during my treatment. Your expertise, compassion, and dedication were evident in every step of my care, and it truly made a difference in my recovery.From our first consultation, I felt reassured and confident in your hands. Your ability to explain complex medical information in a clear and understandable manner was incredibly helpful, and your genuine concern for my well-being did not go unnoticed.I would rate my experience with you a 5 out of 5 and would not hesitate to recommend you to anyone in need of a skilled and caring physician.Thank you again for your outstanding care.Warm regards,Thangapandi S"
    },
    {
        "reviewer_name": "Rangarajan P",
        "period": "a month ago",
        "review": "Excellent hospital service. One of the best place for laparoscopic surgery. Doctors are expertise in their related field and duty doctors are kind helpful. Special thanks to ward sisters who never showed their tiredness and Raksika mam for coordination."
    },
    {
        "reviewer_name": "anu anush",
        "period": "3 months ago",
        "review": "I recently had my minor surgery done by Dr.Delphine supriya mam. From the day i consulted her to the day finalising my surgery she was very clear in explaining my condition which had its own risk. All the doubts were clarified immediately. Overall services was good , all the staffs , nurses, relationship manager were kind enough to do the need-full.Good friendly environment!!..Only the waiting time was bit more .Other than that the food was given on time. Post surgery the doctor and the staffs visited me to ensure everything is fine ."
    },
    {
        "reviewer_name": "Sreenivas Varadan",
        "period": "a month ago",
        "review": "Went for gallbladder removal ( stones ) with Dr Ajay Pai. Surgery went extremely smooth and the doctor explained the whole process beforehand which was helpful. The entire team including anesthetics was very good. Would highly recommend Dr Pai."
    },
    {
        "reviewer_name": "Rajes Krishnamurthy",
        "period": "2 months ago",
        "review": "I have had an excellent experience undergoing a laparoscopy surgery for Hernia. The lead doctor (Dr Niranjan Ravuri ) who treated me was impeccable at his work, he took great care of me, ensured there are no complications but a smooth and successful operation. He walked me through the whole process very patiently and  cleared all ambiguities.As the name of the hospital goes, Dr Niranjan is indeed a GEM of a person. Should anyone require medical attention especially for Hernia, I highly recommend you to visit GEM and consult with Dr Niranjan. The whole hospital runs on ethics and value. The property is clean, friendly and positive. My sincere gratitude to Dr Niranjan and the group of doctors who helped me recover so quickly.I appreciate the kindness of PRO Miss Kowsalya who was very supportive and humble. The staff Nurse Narmadha too was very kind and caring."
    },
    {
        "reviewer_name": "Matilda Karthik",
        "period": "3 weeks ago",
        "review": "I recently underwent a laprascopic hysterectomy and umbilical hernia repair in GEM hospital under the care of Dr. Delphine Supriya. I'm incredibly greatfull to the team of doctors who provided me the excellent care and advice. I'm extremely happy and satisfied with my stay in the hospital and the treatment extended to me."
    },
    {
        "reviewer_name": "Dafney Rodolf",
        "period": "2 months ago",
        "review": "I recently visited Gem Hospital for my health concerns and was thoroughly impressed with the exceptional care I received. The hospital's facilities are neat, clean, and well-maintained.The standout aspect of my experience was the expertise and compassion of the doctors. Specifically, Dr. Nandhini (MD, DGO) accurately diagnosed my ectopic pregnancy, and Dr. Ramya provided emotional support and guidance throughout my treatment.The Radiology department also deserves special mention for their prompt and efficient service.What struck me most was the hospital's affordability and quick discharge process.I wholeheartedly recommend Gem Hospital for its outstanding patient care, cutting-edge facilities, and empathetic staff.*Rating:* 5/5*Recommendation:* Highly Recommended*Special Thanks:* Dr. Nandhini, Dr. Ramya, and the Radiology team\"\""
    },
    {
        "reviewer_name": "Leela Thanga Raj",
        "period": "2 months ago",
        "review": "My mom had been suffering from hernia issues, visited Gem Hospital when it didn't settle.Initially met Dr.Shreeram sir , he had performed laproscopy hernia surgery . Doctor gave us clear information and guidance throughout the process. The PRO team and Sandhiya helped us to clear every doubts. Treatment is good with room and every facilities and Abinishya sister she is very caring now he is recovering.Thank you Dr. Shreeramsir and their team🙏🙏"
    },
    {
        "reviewer_name": "Banumathi Kumaresan",
        "period": "a month ago",
        "review": "All staff at the hosptal were very helpful and supportive.Though my insurance company was not linked with Gem hospital,the insurance staff at the hospital,Saranya helped me to get cashess service to a certain extent,nearly 75%.Thanks all for your guidance.More important,the laprocopic procedure for my husband's hernia complaint,was done neatly and smoothly.My sincere thanks to Dr.Asokan and Dr.Pinak Das Gupta & team."
    },
    {
        "reviewer_name": "Dinesh Samuel",
        "period": "2 years ago",
        "review": "We opted for a good hospital for hernia operation in google and we came to know Gem hospital is good for all stomach related problems with latest laproscopic and robotic surgery. So we went to them for hernia operation.Infrastructure of thehospital is very good and room charges, treatment charges are very reasonable or affordable.The doctors are very experienced and speak with us regarding hernia operation very patiently and with great knowldge including complications in operation. No hospital will explain this much details regarding operation and its treatment... All staffs are very friendly and cooperative.We are so inspired with hospital ,doctor and staffs.. Previous my Dad-in-law went for treatment.Dr. Srivatsan & Dr. Pinak did a great job. They took every step with utmost care and love. They treated us like their relatives and they explained about the difficulties in the operation..this time my wife also  went for annal fissures problem and she is taking treatment there.  now I hope she will be cured completely soon by their treatments.We met Dr. Senthinathan sir.. He is very good surgeon with kind speaking speech and smiling on his face.We can boldly trust and visit gem hospital for any stomach problems and we'll cured by there treatments. They are best in laproscopic treatment.Very BIG thanks to DR. Palanivelu. Great job to this society 🌟.👍🏼 Easy Reachability👍🏼 Great hospitality👍🏼 Big car parking area👍🏼 All the facilities are great👍🏼 Doctors and staffs are very polite.👍🏼 All the rooms are clean👍🏼 Canteen facilities are available.  tasty and healthy foods @ affordable price👎🏼 Nothing"
    },
    {
        "reviewer_name": "rajesh krishna",
        "period": "4 months ago",
        "review": "Hi,I recently admitted my mother for a Hernia surgery at GEM hospital...Dr.Niranjan attended us & took utmost  care of my mother...She was advised to undergo laproscopic surgery. All the Doctors were patient in explaining the procedure & process...Surgery went well without any complications & my mother got discharged in 3 days...Frequent visits of Doctors post surgery, ensured all our queries were addressed in a timely manner.All nurses attended patiently with love..Overall the experience was really good.Thanks to GEM hospital.RegardsRajesh"
    },
    {
        "reviewer_name": "Ekambar Selvakumar",
        "period": "a month ago",
        "review": "Every staff we met responded with care and compassion. Procedures were clearly explained and it's a hassle free experience for us. We are more than glad that we chose GEM. I strongly recommend Dr.Senthil Nathan sir and his team"
    },
    {
        "reviewer_name": "Kumar Raghav",
        "period": "a month ago",
        "review": "Our family will forever be grateful to the entire team at Gem Hospital for their remarkable care, compassion, and dedication in helping my brother recover from acute liver illness. From the moment we stepped into the hospital, we knew we were in capable hands. The expertise of the doctors and the round-the-clock support of the nursing staff brought not only medical excellence but also much-needed comfort to our family during this difficult time.Words cannot truly express the depth of our gratitude towards Dr. Hariprasad, Dr. Snoop, Dr. Vinod, and Dr. Shrujan for their incredible care and dedication in treating my brother during his battle. Their unwavering commitment, expertise, and compassionate approach not only saved his life but also gave our family immense hope and support during a very difficult time.Equally, the nursing staff and dietician played an invaluable role in my brother’s journey. Their gentle and caring approach, attentiveness to his needs, and constant encouragement were a source of great relief. They were more than just caregivers—they were a source of emotional support to my brother and to all of us as we faced each day with uncertainty and hope.Thanks to the combined efforts of the entire team at Gem Hospital, my brother is now recovering well. We are truly blessed to have experienced such compassionate and expert care, and we will always be grateful for the difference they made in our lives during this challenging time.We owe a debt of gratitude to each of these exceptional doctors for their tireless efforts, brilliant medical acumen, and genuine care. They are more than just doctors; they are healers, and our family will always remember them as the ones who gave my brother a second chance at life.Thank you from the bottom of our hearts."
    },
    {
        "reviewer_name": "Amrritha Sivakumar",
        "period": "4 months ago",
        "review": "I recently had an experience at your hospital that I wanted to share. I was admitted with an intussusception, which was an incredibly stressful situation for me. However, the care I received from your team made all the difference.Dr. Ajay was my attending physician, and his presence was incredibly comforting. He took the time to thoroughly explain the biology behind my condition, which helped me stay calm during a very uncertain time. I was admitted on the same day, and the nurses who cared for me were nothing short of wonderful. Despite my occasional tantrums, they remained patient and calm, which I truly appreciate.Before deciding on surgery, Dr. Ajay recommended an ultrasound, and thankfully, the intussusception resolved on its own. I was so relieved that surgery wasn’t necessary, and I’m grateful that Dr. Ajay took the time to carefully consider whether surgery was truly needed, given that my diagnosis wasn’t fully consistent with the symptoms I was experiencing.Throughout my stay, several relationship managers checked in to ensure my comfort and satisfaction with the service. I felt truly cared for, and I would highly recommend your hospital to anyone in need of medical care.I want to especially thank Dr. Ajay for his exceptional care and dedication. His thoughtful approach made a difficult situation much more manageable."
    },
    {
        "reviewer_name": "Jagadeesh Venkatachalam",
        "period": "a month ago",
        "review": "Gem Hospital, Perungudi, Chennai. One of the best medical facility in South Chennai region with all the facilities inbuilt. The hospitality and patient care services are excellent. We have been visiting this place for Gynaec & Hernia treatment of my wife and she recently got operated for hysterectomy & umbilical hernia.Dr. Delphin Supriya (GYNAEC ONCO AND LAPAROSCOPIC SURGEON) and Dr. Ajay Pai (Surgical Gastroenterology) are the doctors who have done the procedures. They are best at their profession and very humble, kindness, supportive to us.We strongly recommend Dr. Delphin Supriya for her commendable knowledge and experience as a Gynaecologist and being expertise in all Gynaec onco and related laparoscopic surgeries. Our heartful thanks to the doctor and her team (Dr. Harishmitha, Dr. Gayathri & Ms. Rashika, PRO) for their splendid patient care, support, relentless coordination w.r.t all subject within the medical facility.Many thanks to Dr. Ajai Pai and his team for their continuous follow-up and patient care post surgery."
    },
    {
        "reviewer_name": "Sakthi Kumar",
        "period": "a month ago",
        "review": "Last month I ve visited your hospital for hernia complaintI was well received and as per my request I was attended by Dr. P. Senthil nathan and was advised to undergo surgery. The procedure was well explained.Madame Pratheeba guided me in respect of insurance etc.The nursing care was also phenomenal.Kudos to your team."
    },
    {
        "reviewer_name": "Mr Pant",
        "period": "4 months ago",
        "review": "I recently received treatment from Dr. Pinak Das Gupta, and I must say he is an amazing doctor—very polite and attentive. The entire hospital staff was incredibly polite and helpful as well. The experience felt more like visiting a five-star hotel than a hospital. Highly recommend!"
    },
    {
        "reviewer_name": "divya",
        "period": "3 months ago",
        "review": "we visited gem hospital Perungudi at 1:30 a.m for an emergency on 30th September 2024.  And at our utmost dire situation we were met with the most atrocious treatment ever from the hospitals side. We were left extremely disappointed, beginning with the slow response of bringing a stretcher to escorting us poorly back into the vehicle. They failed to properly assess the situation and provide the necessary treatment. The only available doctor, Dr.Adarsh, who we required immediate help from responded to our situation with such nonchalant attitude and absurd behaviour. The doctor and other nurses were all incredibly casual and unresponsive to us. At last when he had no other option he finally decided to mention that this hospital doesn’t have the necessary treatment and suggested us to go elsewhere. this could’ve been mentioned to us much earlier and we could’ve avoided the hassle and waste of time. While trying to get back to the vehicle with the patient who was still in need of help, the doctor abandoned the situation and all the other nurses did not even bother to help. We thank  the watchmen alone who tried their best to help us."
    },
    {
        "reviewer_name": "Prashanth Ravi",
        "period": "a month ago",
        "review": "Consulted Pinak sir who is always approachable. Happy with the treatment received. Will follow up with himOverall Good service from all their support staff. Very happy with their response for all queries. Big shoutout to their staff at insurance department for their warm service"
    },
    {
        "reviewer_name": "Poorviha Mahendiran",
        "period": "3 months ago",
        "review": "Good morning. Iam Poorviha. I have consulted Dr. Delphin for my surgery. She is well experienced and took good care of me very well and did laproscopy surgery successfully. The patient care is very good in this hospital. I need to thanks Rashika PRO for her help. She take care of my family very well..especially and I need to share one thing iam in Operation Theatre my family was very scared on that time she gave a special attention to my family. Thank you so much for that. Nurses and other staffs are very helpful and took good care of patient. Excellent facilities and infrastructure. We are very much satisfied overall."
    },
    {
        "reviewer_name": "Ramesh Chaturvedi",
        "period": "2 weeks ago",
        "review": "I was referred to GEM hospital to undergo laproscopic hernia surgery. Ms.Pratibha Dr.Senthilnathan's secretary  made the admission smooth and easy. Dr.Senthilnathan explained the process very well which removed all my anxiety. The surgery was done very professionally.The nurses,staff were very kind and supportive.The room and the toilet were very clean.The hospital ambience was easy on the eyes and refreshing.The insurance department was supportive and the discharge done efficiently.I wish to express my gratitude to Dr.Senthilnathan and his team for having taken such good care of me.I would recommend this hospital and give it 5 on 5."
    },
    {
        "reviewer_name": "Roop N",
        "period": "3 months ago",
        "review": "I had a great experience with Dr. Delphin, our gynecologist, and her team at Gem Hospital Perungudi. My mother had multiple large fibroids, and Dr. Delphin explained everything clearly, guiding us through the entire process. She performed the surgery using laparoscopy, avoiding the need for an open operation, which was a huge relief for us. She also provided detailed guidance on the proper treatment & smother experienceA special thank you to Rashika, the PRO, who was extremely kind and caring. She was always there to answer our questions and made sure we felt supported and ensured we were comfortable throughout the treatment.The entire hospital staff was very professional and kind. We are very thankful to Gem Hospital for such excellent service. I highly recommend Dr. Delphin and her team to anyone looking for expert care."
    },
    {
        "reviewer_name": "Giftson Samuel J",
        "period": "4 months ago",
        "review": "I have consulted Dr.Karthikha mam and Dr. Delphin mamfor my surgery and she treated me well. Doctor explained and she cleared my doubts also without any hesitation. She is well experienced and gave me a good care and did a laproscopy surgery successfully with God's grace. The patient care is very good in Gem Hospital. And especially I need and I have to thanks Rashika PRO for the wonderful guidance from starting till the end. She created a nice pathway for my surgery. And I have to thank Nurses and other staffs are very helpful and gave me a good care. Excellent facilities and infrastructure. We are very much satisfied with their service"
    },
    {
        "reviewer_name": "Arun Kumar",
        "period": "a month ago",
        "review": "Had done a Master health checkup up sponsored by my organisation aligned Medical insurance over here.Was an wonderful and smooth experience with no hiccups thanks to sisters - Deepa and Bhuvaneshwari for coordinating helping out from start till end. Professional service would recommend..."
    },
    {
        "reviewer_name": "Jeni Devi",
        "period": "5 months ago",
        "review": "The hospital and services provided by the Doctors, Nurses and PRO of Gem hospital is very good and highly appreciated. And I have to say thanks to Dr.Delphin Supriya and Dr.Harishmitha Mam she take care me well and made my hospital journey in smooth way.Special Thanks to Rashika PRO for wonderful guidance and team for taking good care and support for quick recovery.Staff members and nurses were responsible.The rooms were very clean and infrastructure was good. Thank you gem hospital"
    },
    {
        "reviewer_name": "Deepan T",
        "period": "5 months ago",
        "review": "The care and attention received from Dr. Delphin Supriya and her staff Rashika was excellent. Everything explained in detail of how, when and where my treatment would occur. I was made to feel completely at ease throughout my mother's Surgery , I received the greatest care and support from start to finish by the Gem Hospital team ,ending with amazing results. Thankyou."
    },
    {
        "reviewer_name": "Mahalakshmi Shanmugam",
        "period": "3 months ago",
        "review": "Excellent hospital. I had my gall bladder removal surgery by Dr. Niranjan and team. He was so polite and helpful. The nurses (Deepika 3rd floor, Rashmika 3rd floor) were very caring and responded immediately. Special mention to ward helpers and cleaning and maintenance team. Insurance team and Kowsalya helped us by making the process smooth."
    },
    {
        "reviewer_name": "sujatha chandrasekar D",
        "period": "2 months ago",
        "review": "I'm very satisfied. In Gem Hospital Dr.Ramya mam  like is God to us. Saved my mother . Thank you mam. Hospital workers, staff nurse. They are very helpful. Sister rashika very helpful full to me  .she told all the precautions to be taken to my mother. Thankyou so much everyone. In hospital management."
    },
    {
        "reviewer_name": "Ever green collection",
        "period": "3 months ago",
        "review": "A thank note to Dr. Yuvaraj Kalianna🙏☺️I recently underwent URS surgery for kidney stones under the expert care of Dr. Yuvaraj Kaliannan at Gem Hospital, Perungudi, Chennai. I'm thrilled to share my exceptional experience!Dr. Yuvaraj's professionalism, compassion, and expertise instilled confidence from the initial consultation. He explained the procedure, risks, and recovery clearly, addressing all my concerns.The surgery was seamless, and I experienced minimal discomfort. Dr. Yuvaraj's surgical skills and attention to detail ensured a successful outcome.Post-operative care was top-notch, with regular check-ins and personalized attention. The hospital staff was courteous, efficient, and supportive throughout my stay.I'm deeply grateful to Dr. Yuvaraj and the Gem Hospital team for their exceptional care. I highly recommend Dr. Yuvaraj for his:1. Expertise in urology2. Compassionate bedside manner3. Clear communication4. ProfessionalismIf you're seeking treatment for urological issues, look no further! Dr. Yuvaraj Kaliannan is an outstanding choice.Rating: 5/5 starsThank you, Dr. Yuvaraj for restoring my health and well-being!"
    },
    {
        "reviewer_name": "Priyanka S",
        "period": "4 months ago",
        "review": "My heartfelt thanks to Gem hospital. Thank you for your outstanding dedication and care. Overall treatment was so good. The services were good  and  all doctors ( especially DR. Senthilnathan)  and   all   staffs  (especially PRO  sandhiya) were excellent in all ways. Once again my heart felt  thanks for your unwavering dedication to patient care."
    },
    {
        "reviewer_name": "rp arjun",
        "period": "4 months ago",
        "review": "Patien experience at Gem was excellent! The doctors and the staff were very considerate and understanding.We were able to discuss with Dr Palanivel and Dr Senthilnathan about the surgery and the likely complications along with the comorbidities. Dr. Palanivel explained in detail the procedure that was done on the patient and gave us the confidence in them. Dr. Palanivel and his team did a great job performing the surgery and the post surgical care. We did have some setbacks with the patient's health during the recovery process but the doctors were on top of it and informed and explained to us every step that was to be taken for the treatment. They were kind enough to hear our concerns and explained the solutions with patience.The overall experience of all the doctors of the team and staff has been excellent and 100% committed.A special mention about Ms Pratibha who has been of immense help right from day one coordinating every aspect of it.Dr Sreeram, Dr Praveena, the anaesthesia specialist, the ICU doctors and team for having put in their best and exhibited absolute professionalism and dedication.The nursing staff and ward boys who have been the one handling the patient throughout his stay in the hospital- kudos to these unsung heros.My best compliments to Team Gem Hospitals.Jai hind"
    },
    {
        "reviewer_name": "Liyaqath Ali",
        "period": "4 months ago",
        "review": "Consulted Dr. Senthilnathan for gall bladder surgery. Excellent hospitality and treatment. All the staffs and ward persons are very kind and helpful all the time. Overall a very friendly and supportive environment. Thanks to senthil sir for being soft-spoken and explaining the issue elaborately. Very much satisfied and highly recommended."
    },
    {
        "reviewer_name": "anu sugirtha",
        "period": "3 months ago",
        "review": "HiWe came in an emergency situation from a long distance for a second opinion after appendix laparoscopy surgery for my brother since the fever was occurring at regular intervals after the surgery and we didn't know the cause of the fever, but once we stepped in, the treatment started in full swing within a few hours, and Dr. Srivatsan Gurumurthy Sir suggested the best treatment for my brother. My brother was admitted immediately, and Dr. Srivatsan Gurumurthy Sir explained the treatment process in a detailed manner, and the best treatment was given for the upcoming days. My brother's health started to improve day by day. Thank you so much, doctors and team who analysed my brother with utmost care. A special mention to the nursing staff, who regularly checked my brother and talked to him in a friendly manner with the utmost care. Thank you so much, all nursing staff. The rooms were maintained clean, and the food suggested by the dietician was provided regularly. Thank you to each and every one who helped in my brother's recovery.Thank you so much, Gem Hospital 😇and team, for such caring treatment. I would highly recommend the hospital for the necessary people for treatment."
    },
    {
        "reviewer_name": "Sri Rangan",
        "period": "4 months ago",
        "review": "Hi i went to GEM Hospital Perungudi for my father's Hernia Surgery and was referred to Doctor Shri Pinak Dasgupta. Excellent Doctor who guided us well throughout the surgery. Special thanks to PRO Kowsalya ma'am. Initially we were clueless about the cost and procedure . But she guided us so well. Excellent hospitality extended by her.Overall the entire Hospital team was good. Rooms were also so neat and clean. Will definitely recommend this hospital for any stomach related problems."
    },
    {
        "reviewer_name": "Danny John",
        "period": "6 months ago",
        "review": "I recently had the opportunity to experience the care at GEM Hospital firsthand, and I was blown away by the exceptional service and compassion shown by the entire staff. From the moment I arrived, I felt welcome and supported by the friendly and efficient reception team.The medical team, including the doctors and nurses, were top-notch and provided clear and concise communication throughout my stay. They took the time to answer all my questions and addressed any concerns I had, making me feel comfortable and confident in their care.The facilities were modern, clean, and well-maintained, and the food was surprisingly delicious! But what truly sets [Hospital Name] apart is the genuine kindness and empathy shown by every single staff member I encountered.I highly recommed GEM Hospital to anyone seeking medical care. Their dedication to patient-centered care is evident in everything they do.*Pros:* Compassionate staff, excellent communication, clean and modern facilities."
    },
    {
        "reviewer_name": "Sundar Moorthy",
        "period": "4 months ago",
        "review": "The hospital and services provided by the Doctors, Nurses and PRO of Gem hospital is very good and highly appreciated. And I have to say thanks to Dr.sree ram. He take care me well and made my hospital journey in smooth way.Thanks to sandhya mam  nd Sujatha mam for wonderful guidance .My special Thanks to nurse Deepika in 3rd floor  she taking good care nd good supporting .she treat like family member. Thank you all doctors,staffs nd nurses.The rooms were very clean and infrastructure was good. Thank you gem hospital.."
    },
    {
        "reviewer_name": "naveen kumar",
        "period": "a week ago",
        "review": "I have visited Gem Hospital for Master health check up. The staff were gentle and guided nicely. Overall excellent experience."
    },
    {
        "reviewer_name": "Anantharaman Deivanayagam",
        "period": "4 months ago",
        "review": "My age is 80, Dr. P. Senthilnathan is the best have seen in my life. If you are in GEM Hospital, no worries they are taking care in all aspects. Insurance department well cooperative, PRO supported much as required. Thanks to all."
    },
    {
        "reviewer_name": "Raja Sekar",
        "period": "a month ago",
        "review": "The service was good. Front office staffs  are very friendly. Nandhini admin guided the process very politely. Nurses Sripriya and Bharathi took excellent hospitality. Dr. Nithya is very professional explained the condition very well and the recommendations are really appreciated. Thank you for your hospitality and service.Mostly recommended hospitality service near to WTC"
    },
    {
        "reviewer_name": "Gopi Nathan",
        "period": "4 months ago",
        "review": "One of the best hospital. We went for my wife gall stone problem and met Dr. Sreeram. He was so kind and explained so clearly. Then my wife got admitted to hospital to remove the gallbladder.All doctors and nurses are so kind and patient. They provided the best treatment and services. Thanks Sandhya and team for your guidance and support."
    },
    {
        "reviewer_name": "Shanthi Narayanaswamy",
        "period": "3 months ago",
        "review": "I have admitted in gem hospital for Hysterectomy  surgery..   we received  a nice hospitality  good attention & care.. Srevices rendered by the nurses, house keeping person  are also good.   Gynaecologist Dr. Karthika is very good in her work as well as very kind enough in explaining  all our queries..Anaesthetist Dr NarmadaMam  is very good in her work.. overall performances  are good. Thank you very much.. I can't  say any fault onGemssrevices.. Thankyou"
    },
    {
        "reviewer_name": "Rehmanbee Shaik",
        "period": "5 months ago",
        "review": "It all started from a normal health check and ended in curing a fibroid of 10cm. Very surprised with the way the whole procedure was dealt. It was the experience of Dr Nandhini, one of the best I have ever met. The whole procedure went smooth and transparently. The nursing staffs were very good in taking care of the patient. No last minute surprises with what to expect throughout the treatment was something special with GEMS hospital. Congratulations to Dr nandhini for one more successful surgery and really thankful for her support and guidance throughout. The PRO support was also good and rashi did help us guiding clearly on all the process and documentations. The transparency with insurance can be improved but really not of a concern though. All were excellent."
    },
    {
        "reviewer_name": "Mohana Devi",
        "period": "5 months ago",
        "review": "My name is Mohana Devi. I have done my consultation and surgery done was done by Dr.Delphin Supriya. She was so humble and she clearly clarifying my doubts. Most importantly she was making my confidence boosting and recover me soon. And I need to thanks Radhika PRO and nursing services and House keeping services. I have recommended Gem Hospital for their  beautiful atmosphere. Thank you gem"
    },
    {
        "reviewer_name": "Nivethitha rajan",
        "period": "5 months ago",
        "review": "I visited gems hospital recently for my corporate health checkup. Firstly they called and confirmed with me the previous day at what time I'll be visiting. On the day of my appointment there was a personal nurse attendee Bhavani who literally took care of me for the entire process kudos to her. Every lab technician was very kind and they apologized by themselves for any unavoidable delays in one or two tests. Overall this is the best place for checkup in terms of time and service. Cleanliness is one factor they should concentrate on for bathrooms"
    },
    {
        "reviewer_name": "HEENA V JAINY STUDENT - MBA ( ODL )",
        "period": "3 months ago",
        "review": "Dr Ramiya doc  was the head Gynecologist and main surgeon and Rasika mam was the  department coordinator everything went with proper flow. Very good service by Care taker on the whole exceptional service. Medicaim department too responded well."
    },
    {
        "reviewer_name": "Revathy Rangan",
        "period": "2 months ago",
        "review": "Normally whenever we get admitted in hospital for a procedure or treatment, there will be two pain.  One due to the disease.  Another one on Cashless claim.  But, the experience at GEM hospital was awesome.The treatment & surgery at GEM  by Dr. Senthilnathan and team was simply superb.  I would like to mention Dr.Praveena who is tirelessly working as a HONEY BEE by delivering close and friendly attention to details and approach made us very comfortable.  Very happy.The insurance team members at GEM hospital are very knowledgeable and patient friendly.  They were transparent and afront disclosing the cost covered by insurance, etc.  I need to mention Mrs. Saranya from insurance stayed back late to clear the insurance queries.  Her expertise in handling the TPA queries were commendable.Overall, the experience at GEM hospital was seamless relief.GEM hospital is a real GEM!!!."
    },
    {
        "reviewer_name": "Kirupa Srinivasan",
        "period": "a month ago",
        "review": "Visited hospital with my husband for health check up... The way they treated is was very good. Sister Bharathi was very helpful and kindly.. doc explanation was very clear and polite..."
    },
    {
        "reviewer_name": "Ajith Kumar M P",
        "period": "5 months ago",
        "review": "Dr.Srinivaasan performed surgery for my father on July 14 .Thanks to his expertise, the surgery went very well and my family is grateful to him. GEM hospital staffs were very responsible, supportive and cared a lot.Insurance process was very smooth.Thank you, GEM."
    },
    {
        "reviewer_name": "Pinky Milton",
        "period": "5 months ago",
        "review": "Tow days back I undergone uterus removal surgery.  Dr. NANDHINI was treating me nicely and emotionally positive approach.  Thank you mam for your care and treatment. Another Dr we met was kind and responded well even they bothe visited the ward after surgery . And PRO Rashika was very helpful and good in communication.  Thank you GEM"
    },
    {
        "reviewer_name": "Ramakrishnan R",
        "period": "a month ago",
        "review": "Have gone to GEM hospital Perungudi for annual health check up.Well coordinated process , thanks to Bharathi and Sri Priya.Excellent doctor consultation. she explained the results with the reasons behind and remedies to improve."
    },
    {
        "reviewer_name": "Aishwarya Mohan",
        "period": "2 months ago",
        "review": "MR.Dr. Bala mukunthan he makes a big effort to make me feel comfortable life and let me know what to expect. He is very good doctor, he will take care as a family member. he is very relaxing to speak with at every appointment. It’s rare to find a doctor that combines such personal touches and care for a patient as a person with outstanding quality of medical care.Dr Mr.Bala mukunthan has did kidney transplant surgery to my husband Manikanda prabu from GEM hospital and he recovered soon and he is one of the best kidney  transplant doctor.I once again Thanks to all of you Doctors and staff.Especially Angel mam transplant co ordinator guided very well and motivated every time.Dialysis staffs all are polite, friendly, and very caring persons.⚕️Thanks and RegardsISWARYA MANIKANDA PRABU"
    },
    {
        "reviewer_name": "murali krishnan",
        "period": "a month ago",
        "review": "My wife had a laparoscopic surgery for endometrium cyst removal. Dr Divyambigai mam referred me to Dr. Delphine supriya mam of GEM hospital. From the moment I have arrived, Dr Delphine supriya mam team (medical team) were thoroughly explained my wife condition and how the surgery going to done, which gave me clear view and good confidence. I like to thank PRO Rashika who coordinate with us. my heartfelt gratitude to Dr Delphine supriya, her team of doctors, and the entire nursing staff at Gem Hospital."
    },
    {
        "reviewer_name": "Lissy Mathew",
        "period": "4 months ago",
        "review": "We are extremely happy with Dr. Vairamala especially her approach with the patient was commendable. GEM hospital is neat and clean. The service rendered by the hospital is good.A little more care and professionalism are expected from the staff."
    },
    {
        "reviewer_name": "Sneha Sundar",
        "period": "6 months ago",
        "review": "I had my surgery with Dr Delphin for my ovarian cyst.. from the start she is amazing, she is patient and listens to our concerns.. she also took the perfect approach to operate it. I am so thankful to have her as my doctor. Her PRO Ms.Rakshiga is very helpful to schedule appointments and is very active in communication and coordination."
    },
    {
        "reviewer_name": "logesh A",
        "period": "3 months ago",
        "review": "First of all the hospital was not money minded  good and well maintainedDr.pinak sir hernia surgeon very kind person to speak and explain clearly about hernia problem my wife. Who treat well in big size of hernia on a lapro surgery that is very rare to do on lapro but he done well now my wife is very well…  thank you DR.Ashokan sir and Dr.pinak sir and thanks to GEM HOSPITAL ( lot of people search not money minded hospitals and best treatment in Tamil Nadu but few only in service minded so that you gave a service and best treatment and then clearly tell a what is the operation cost for the surgery and what help us to support from your side.. so thank you )🙏🏻"
    },
    {
        "reviewer_name": "senthil kumar",
        "period": "3 months ago",
        "review": "Hi. Iam suganthi. I came gem hospital with many problems but now Iam getting well because of Dr.Delphin mam. She gave a excellent treatment to get me well soon. She  explained me each and every procedures. Yesterday my surgery was completed with god's grace. And I need to thanks all nurses, hospital staffs etc.. Gynaecology Department was very good in this hospital. And I need to thanks for Rashika PRO for guidance, care, she guide us in a great way, She came for rounds in every morning with smiley face. Thanks for that Rashika. And ward staffs also gave a nice service without any hesitation. I highly recommend Gem hospital. Thank you God.."
    },
    {
        "reviewer_name": "Manikandan Gunapooshanam",
        "period": "a month ago",
        "review": "Had very good experience in hospital and the staffs are really helpful even asking multiple questions(bhuvaneshwari & Deeba). The reports are very clear and the doctor clarified all my doubts without scare. Preferred others to choose for health checkup."
    },
    {
        "reviewer_name": "Vaishnavi Kumar",
        "period": "3 months ago",
        "review": "We had visited GEM HOSPITALS  for an overall Healthcheck.Premises were Clean and professional Healthcare personnel provided quality support.Cafeteria food was decent and rates were same as regular outside shops.Highly recommended for anyone looking for a good hospital and infrastructure.Special appreciation to deepa sister for following up and providing quick support between the tests."
    },
    {
        "reviewer_name": "Blessed Monica",
        "period": "3 weeks ago",
        "review": "Excellent service! Dr. Senthilnathan is the best and kindest doctor I have ever met. The personal secretary and staff are also very responsive friendly and welcoming."
    },
    {
        "reviewer_name": "Market Mystery Secret Trader",
        "period": "2 weeks ago",
        "review": "Good service and coordination. I went for master check up Parmeshwari and Bhuvaneshwari assistant staff coordinated well still the end process. Doctors also recommended right steps moving forward"
    },
    {
        "reviewer_name": "santhosh boopalan",
        "period": "3 months ago",
        "review": "Thank God and the team of GEM hospital .I took my wife for an gastro problem the team throughly diagnosed and identified other related issues pertaining to her health and given good treatmentDr nandhini gynec explained about the cyst and its laproscopy surgery.Surgery was successful one . Nursing and care during the stay was satisfactory"
    },
    {
        "reviewer_name": "pritha raj",
        "period": "2 months ago",
        "review": "I recently underwent a laparoscopic surgery at GEM, perungudi under Dr. Karthika Mam. She is a patient's doctor, unwaveringly answering all my doubts and her skills,bedside manners are exceptional. Dr.Vanmathy mam in Anesthesia was equally exceptional and allayed my fears. All the nursing staff, housekeeping staff are very warm in their interactions and made me feel comfortable. Ms.Rashika, the PRO here also helped in making the admission and insurance process very smooth.Thanks for making this scary time,  a very peaceful one for us, as a family"
    },
    {
        "reviewer_name": "pon raj",
        "period": "3 months ago",
        "review": "I recently received treatment from Dr. Pinak Das Gupta, and I must say he is an amazing doctor. The entire hospital staff was incredibly polite and helpful as well. The experience is very good"
    },
    {
        "reviewer_name": "Ananadhan M",
        "period": "4 months ago",
        "review": "Dr pinak dasgupta :Surgery was done successfully.We are very very thankful to the team of Doctors who had helped and made me perfectly alright.Also we are very happy about the treatment given to us by the hospital staff.The hospital is certainly extremely service minded.We don't find adequate words to express our gratitude.Once again thanking you, Doctor, Pinaki."
    },
    {
        "reviewer_name": "Nithyasri",
        "period": "4 months ago",
        "review": "Dr Ajay G pai Sir...I Highly recommend. My mother faced numerous issues after two previous surveys. We came here afterward, and Dr. Ajay Pai gave us confidence with his humble demeanor and thorough explanations. He addressed all our doubts, explaining everything about my mother’s condition clearly, often taking the time to explain things twice or even three times. The laparoscopic hernia surgery was successful, and now my mother is completely well. Thank you, Dr. Ajay Pai sir."
    },
    {
        "reviewer_name": "Iswarya J SVV",
        "period": "3 months ago",
        "review": "My daughter had undergone major surgery last week.Dr Delphin explained about surgery and further treatment & process with utmost care.she is very supportive with the kid. Dr Rejiv explained all our doubts. Dr Vanmathy and her team also explained about surgery & anaesthesia.Surgery went on well,Post operative care was good by the team.All nursing and support staff were helpful. PRO Rashika was taking care from appointment till discharge, Insurance staff was good.Room was clean.Overall experience is good."
    },
    {
        "reviewer_name": "Srinivasan Viswanathan",
        "period": "4 months ago",
        "review": "I had a hernia operation in one hospital and the mesh was infected. So after doing lots of research over Google I decided to consult Dr. Pinak Das Gupta of Gems Hospital. I went to this hospital after seeing the positive reviews provided by  various patients in the Google. I had a good experience and the doctor was very polite and I recovered within a month.Even after surgery doctor was free to pick up the calls whenever required."
    },
    {
        "reviewer_name": "aarthi nambi",
        "period": "4 months ago",
        "review": "I have operated for herina in gem hospital and Dr. Niranjan operated very well he is a experienced doctor very quiet and calm handled us in a good manner and I had a speedy recovery without pain. Ms. Sandhiya guided and take care us very well. Rooms are maintained very neat nd clean"
    },
    {
        "reviewer_name": "veera h",
        "period": "a month ago",
        "review": "This is our first time in this hospital.first of all really kind that all the reception peoples. Especially second floor call assistant miss mahalakshmi is very dedicated staff ,we are sitting in almost half hour in that particular time she never miss any calls and also the answer was so politely.and also miss  rajeshwari also very kind and unique.it's very good experience"
    },
    {
        "reviewer_name": "Karthick Gurunathan",
        "period": "3 months ago",
        "review": "I had a very good experience in perungudi Gem hospital. I took a interstain surgery with most care from doctors and team. The major surgery done by Dr. Srivatsan and team with in 3 to 4 days I got recovered. I am not faced any pain during and after surgery. I am strongly recomading the Gem hospital for stomach related issues. Th team tacking care excellent till discharge."
    },
    {
        "reviewer_name": "Vinoth Babu",
        "period": "a month ago",
        "review": "Came to GEM for master health checkup. Very professional and clean environment.Sister Bharathi and bhuvaneswari assisted very well in taking test on time and clarified questions very patiently. Very satisfied with the Hospital."
    },
    {
        "reviewer_name": "NjIeTyHaYpAa KCTAM",
        "period": "a week ago",
        "review": "Did Master Check up with spouse. Was quick clean and efficient. We were guided through the full process with staff assistant. Good experience"
    },
    {
        "reviewer_name": "senthil kumar",
        "period": "5 months ago",
        "review": "Thank you to the entire hospital staff and particularly Malliga Mam for their exceptional hospitality and care. Your professionalism, kindness, and attention made a significant difference in my experience. I am truly grateful for the outstanding service I received."
    },
    {
        "reviewer_name": "Bala Ganesan",
        "period": "2 months ago",
        "review": "Please don't go to GEM, chennai for any need or emergency or important medical problems....they wate ur patient life time and give wrong direction due to lack of knowledge and infrastructure of hospital..it's just a clinic..not hospital...if u go with problem, nobody is having knowledge to cure..just time pass. God's grace, i shifted and saved one person life after observing those treatment. They insisted to go dialysis for normal infection in stomach...please please please please, don't take any risk in iife..."
    },
    {
        "reviewer_name": "Sam Raj",
        "period": "3 weeks ago",
        "review": "Reporting system and doctor consultation found excellent. Compare others. Especially timing and timely reporting and feel very good doctor consultation. Dr. Hearing all the things and advices good things patiently."
    },
    {
        "reviewer_name": "Kakarla Lakshmi Narayana",
        "period": "4 months ago",
        "review": "Dr Pinak Dasgupta has performed fistula and haemorrhoid procedure for me in excellent way. In my opinion he is very humble and gentle. Hospital staff service  is good."
    },
    {
        "reviewer_name": "Deepa Sri",
        "period": "3 months ago",
        "review": "We had a laproscopic surgery in GEM hospital. The facilities are world class. Caring and accomodations are good. All staffs and doctors are friendly and available at all the time and resolved all the queries raised with patience. Dr.Sharadha is the one who suggested to do this surgery at GEM. She gives best consultation for all gyneo related problems in a friendly manner. I would like to thank Dr.Nandhini and Dr.Delphin for their support throughout this course. And special mention to Ms.Rashika for coordinating with us to make this possible."
    },
    {
        "reviewer_name": "Singaravelan Dinesh Narayan",
        "period": "4 months ago",
        "review": "My wife was admitted for gall bladder removal and this was treated by Dr. Senthilnathan and his team. The service was excellent. Special thanks to Sandhya  PRO for making all the necessary timely arrangments. Thank you."
    },
    {
        "reviewer_name": "Balaji Karnan",
        "period": "5 months ago",
        "review": "Dr. Pinak performed my fistula surgery on the morning of July 12th. Thanks to his expertise, the surgery went very well, and I am now recovering normally. I am grateful for his guidance.Additionally, Kowsalya from the hospitality team was incredibly supportive throughout my hospitalization, providing attentive care and clear explanations.Post-surgery, the entire medical team provided excellent and supportive care.Overall, the services provided by the nurses, caretakers, ward boys, and hospitality team were exceptional and highly appreciated.Thank you, GEM."
    },
    {
        "reviewer_name": "Solomon Raj",
        "period": "2 months ago",
        "review": "Dr.Yuvaraj Kaliannan is a renowned Urologist & makes robust & apt diagnosis & executes with measured precision.The  Medical Support Staff, ably led by sister Malliga does superb co-ordination."
    },
    {
        "reviewer_name": "Pavithrra Venkatraman",
        "period": "2 months ago",
        "review": "My dad has a minimal invasive surgery. Right from entry to exit everybody was VERO considerative and caring. Excellent rooms and service. Dr. Pinak Das Gupta explained the condition and procedure clearly and guided very well with the post operative care too"
    },
    {
        "reviewer_name": "Ashok Damodaran",
        "period": "5 months ago",
        "review": "Today, I completed my health check-up at Gem Hospital in Perungudi. They followed the proper procedures to complete all the health check formalities. I want to thank the doctors, staff, and lab technicians for their support.Hello Bhavani Mam,I am writing to express my gratitude for the exceptional support you provided during my time at your hospital (Gem Hospitals, Perugudi). You scheduled the necessary check-ups, assisted me in completing all the healthcare procedures and formalities, collected the reports, and finally accompanied me to the doctor for consultation. You also ensured that all the diagnosis reports and documents were properly filled out. Your planning helped to avoid any wastage of time. I truly appreciate your service and support. Thank you so much."
    },
    {
        "reviewer_name": "App K",
        "period": "3 months ago",
        "review": "My wife underwent laparoscopic gallbladder surgery by Dr. Pinak Dasgupta. He is well experienced. Kausalya of PRO team is very helpful, excellent service by nurses."
    },
    {
        "reviewer_name": "praba karan",
        "period": "a month ago",
        "review": "Really recommended..! Very kind and supportive staffs(Maha laxmi) Incredible service... They didn’t even panic me by saying any negative words even when i am really upset and scared . Really motivated and gave very polite and positive words and really treated so quick and fast..Really best ever service provided...... Special thanks for mahalakshmi and Gem hospital 🏥 🙏🏻"
    },
    {
        "reviewer_name": "Kavya Dharshini",
        "period": "a week ago",
        "review": "I did a master health check up. The service was good and the doctors were friendly. They addressed all my concerns and queries."
    },
    {
        "reviewer_name": "FAIZU TRADING",
        "period": "5 months ago",
        "review": "We consulted Dr.Srivatsan Gurumurthy S sir and Dr.Delphin mam for my wife. Both of them are well experienced and they gave a good and Excell care for my wife  and they did a laproscopy surgery successfully. The overall patient care was very very good. Nurses and other staffs are very helpful and took good care of patient. And I need to say special thanks to Meenakshi PRO and for Rashika PRO for theirs wonderful guidance till the end. Excellent facilities and infrastructure. We are very much satisfied overall."
    },
    {
        "reviewer_name": "Danies Kitchen",
        "period": "2 months ago",
        "review": "One of my Daughter's friend visited for having vomiting,  weight loss and also hair fall and fatigue.  A Lady doctor in perungudi just checked her haemoglobin test and told her everything is normal and she will be ok if she do physiotherapy two days before. And the vomiting didn't stop and I told her to take test for as I suspected it may be jaundice. When tested she had bilirubin level 3.3 and serology test abnormal . I want anyone to check whether they have qualified doctors and fake frauds as doctors."
    },
    {
        "reviewer_name": "Megala Baskaran",
        "period": "4 months ago",
        "review": "I had my surgery in Gem Hospital. It was very nice experience.Thank you to the entire hospital staff and I need to special thanks Dr.Senthilnatgan, Dr.Srinivaasan sir and Dr.Delphin mam. And I need to thanks PRO Meenakshi and Rashika PRO  for their exceptional hospitality and care and for their wonderful guidance. I am truly grateful for the outstanding service I received from all of you. Thank you gem"
    },
    {
        "reviewer_name": "Purushothaman Ayyaswamy",
        "period": "6 months ago",
        "review": "Dear Doctor the services provided is really impressive and delightful. We enjoyed the treatment given and care taken by Doctors and all the service staffs are exemplary. Especially by Dr. Senthilnathan,the Chairman of GEM hospital,kind words advice and  enquiries about the treatment and conditions of health of patients are really encouraging Thanks Doctor"
    },
    {
        "reviewer_name": "Papa Appa",
        "period": "5 months ago",
        "review": "GEM Hospital Perungudi, Chennai is one of the best hospitals in Tamil Nadu, or even in India for various health issues / conditions. Dr Palanivelu sir has got great hands for laparoscopic surgery. Supporting Doctors were also excellent. Specifically to mention Dr. Sreeram, Sr. Consultant. A special mention about three, Urologist Dr. Yuvaraj, his secretary Ms. Malliga, excellent human beings. And last but not the least the very important person Ms. Prathiba, Dr Palanivelu's secretary though I had difficulties in reaching her out in the initial stages things went very well and she had done an excellent coordination later and from the time of admission and till discharge. Nursing and support staffs were excellent and always kind and smiling. Hospital is very neatly maintained. Patient food served was excellent quality. In medical treatment, we don't use such statement. But I would go ahead and say that. \"\"Getting a treatment from GEM hospital is value for money\"\". The director of the hospital visited personally and wished me a continued well being. So kind of her. Thank you Ma'am. Hence, I would strongly recommend this hospital as the best one. While these are many positives, there are few areas where they can improve things. (a) Digitizing patient records (b) Having an internal CT Angiogram facility / equipment - I am not sure if they did not have specific CT Angiogram what the Cardiologist recommended to do for me. Later the CT Angio requirement was proposed as optional. (c) Cleanliness of the common bathrooms and toilets (d) Something has to be done at the Canteen located at the 5th Floor about FLIES. Though the fly trap is there, its not working with the flies. Canteen Bill Counter can smile a little to make our minds also smile. He (a young boy) always talks with a grim face."
    },
    {
        "reviewer_name": "MOHAMED IMRAN",
        "period": "4 months ago",
        "review": "Dr.Srinivaasan performed Pancreas open  surgery for my brother on last year  the surgery went very well. GEM hospital staffs were very responsible, supportive and cared a lot. Now my brother complete recovery. AlhamthulilahThank you, GEM.                                                 Advised my friend RIYAS say, Go to GEM Hospital."
    },
    {
        "reviewer_name": "Rosegan 2317",
        "period": "3 weeks ago",
        "review": "I got a very good experience in this hospital.. especially the service is too good I will put 5star rating..here I have to express my happiness and appreciation to the staffs Sripriya, Lavanya, poongulali..they are giving very good support and guidance thanks a lot team."
    },
    {
        "reviewer_name": "Raghavan Sankaralingam",
        "period": "6 months ago",
        "review": "After a year of uncertainty about my inguinal hernia, my consultation with Dr. Ajay G Pai was efficient and informative, resulting in surgery on first consultation. During my hospital stay, I experienced exceptional care from attentive doctors and supportive nursing staff, the hospital environment was notably clean and well-maintained.Upon discharge, Director visited room with a caring note, which I found to be a thoughtful touch. Thanks to the excellent care I received, My recovery has been remarkably rapid and continues to progress."
    },
    {
        "reviewer_name": "veydant Shan",
        "period": "a month ago",
        "review": "Good morning excellent service, Dr Ajay sir given good briefing about the stomach and hernia problem, with patience and care, thanks for guidance. And staff take s.more Care and helped with patience."
    },
    {
        "reviewer_name": "Banu perumal",
        "period": "4 months ago",
        "review": "Medical Gastro team is the best team in Gem hospital. Had consultation with Dr.Umashankar and he was super good in explaining about the complications and comborties . keeping us at ease during the hospital stay and Multiple visit to IP wards to clarify my doubts a down to earth person. Hospital ambience is top notch. Felt like staying at homeStrongly recommended."
    },
    {
        "reviewer_name": "Sujit",
        "period": "6 months ago",
        "review": "I recently underwent gallbladder surgery at Gem Hospital in Chennai, and I am incredibly grateful for the exceptional care and expertise provided by Dr. C. Palanivelu and Dr. Shreeram.Having suffered from gallstones that affected my pancreas, I was in urgent need of surgery. From the moment I arrived at Gem Hospital, I was impressed by the professionalism and kindness of the entire staff. They made me feel at ease and confident in the treatment process.Dr. C. Palanivelu and Dr. Shreeram are true experts in their field. Their knowledge and skill were evident throughout my treatment journey. They took the time to explain the procedure thoroughly and answered all of my questions, which helped alleviate any concerns I had.The level of care I received at Gem Hospital was outstanding. The facilities are modern and well-maintained, and the nursing staff was attentive and compassionate. I felt reassured knowing that I was in capable hands.Thanks to the skillful surgery performed by Dr. C. Palanivelu and Dr. Shreeram, my recovery has been smooth and steady. I am feeling better than I have in a long time, and I credit this to the excellent medical care I received at Gem Hospital.I highly recommend Gem Hospital to anyone in need of surgical care. Dr. C. Palanivelu and Dr. Shreeram are not only highly skilled professionals but also caring individuals who prioritize their patients' well-being. My experience at Gem Hospital exceeded all expectations, and I am thankful for the positive impact they have had on my health."
    },
    {
        "reviewer_name": "Diwan Kumar",
        "period": "a month ago",
        "review": "We visited the hospital for annual health checkup they treated us well. Sister Ms.Barathi was coordinating and guiding us extremely good... Also, Docs here explained us clearly."
    },
    {
        "reviewer_name": "Dhrushya Rangan",
        "period": "10 months ago",
        "review": "Excellent extra care by all doctors, all attendees, service staffs. Peaceful experience in hectic health issue. Special thanks to Dr Senthilnathan (Gastroenterologist). His service to humanity is highly appreciatedSpecial thanks to the insurance team of the gem hospital for the support given to get full cashless service as personal care.Insurance departments timely support given.Will recommend for others also"
    },
    {
        "reviewer_name": "Praveen Raj",
        "period": "a month ago",
        "review": "Staff and servicing was very good. Nurses were very cooperative at any time. Thanks to Rashika for making all the arrangements hassle free"
    },
    {
        "reviewer_name": "Yugan Chithiraputhiran",
        "period": "5 months ago",
        "review": "I am writing to express my heartfelt gratitude to Dr. Senthilnathan P., his team of doctors, and the entire nursing staff at Gem Hospital, Chennai, for the exceptional care provided to my mother during her treatment for a major Hernia.From the outset, Dr. Senthilnathan displayed not only his expertise but also his compassionate approach to patient care. He took the time to speak with my 71-year-old mother, understanding her anxiety, and reassured her about the minimally invasive nature of the procedure. His calm demeanor and clear communication instilled confidence and comfort in both my mother and our family.Dr. Senthilnathan's proficiency in Laparoscopic surgery was evident as he successfully performed what was initially considered to require an open surgery. The procedure was completed with minimal invasion, and my mother was able to walk back home within a week. This quick recovery period exceeded our expectations and underscored Dr. Senthilnathan's exceptional skills.The hospital environment at Gem Hospital, Chennai, further enhanced our positive experience. The facility was impeccably clean and maintained a welcoming atmosphere that did not feel like a typical hospital. This contributed significantly to my mother's comfort and overall well-being during her stay.I wholeheartedly recommend Gem Hospital, Chennai, and Dr. Senthilnathan P. to anyone seeking advanced care for gastroenterology-related treatments. Their dedication to patient care and medical excellence is truly commendable.Thank you once again to Dr. Senthilnathan and the entire team at Gem Hospital for their outstanding service and care."
    },
    {
        "reviewer_name": "Ramya Ramamoorthy",
        "period": "5 months ago",
        "review": "My relationship with Gem hospital dates back from 2017 when i did my Gastric sleeve surgery in Gem hospital coimbatore.Their services and medical expertise are excellent. Years have rolled by .Now  I had my pregnancy C- Section  in Gem hospital , Perungudi a few days before.  THeir growth and hospitality and facilities have amazed me .The Doctors of Gynaec department have been taking good care of me for the  past 9 months from the date of conception.I thank so much Dr.Delphine Supriya madam, Dr.Nandini madam and Dr.Harishsmitha madam for their utmost care, guidance and help with their Excellent Expertise..... I thankMiss. Rashika PErsonal relation officer of gynaec department and all the nurses of gynaec department for the kind help .The facilities were modern, clean, and well-maintained. Genuine kindness and empathy shown by every single staff member I encountered all departments .One of the Best hospital in chennai  with On Spot \"\" MEDICAL SERVICES AND EXPERTISE\"\".  Food provided to the patient is so good with best nutritionist advise.I woulf recommed GEM Hospital to anyone seeking medical care. Their dedication to patient-centered care is evident in everything they do."
    },
    {
        "reviewer_name": "Ramaragavendar Ramaragavendar",
        "period": "a month ago",
        "review": "visited Dr.senthilnathan sir for the  my father health  issue he cleared all the doubts and suggested some test .....I got cleared about his  issues. Thank you all the staffs who guided me from reception ,billing and  scan  department till the end. I will strongly recommend this hospital"
    },
    {
        "reviewer_name": "Sandhya Baskar",
        "period": "5 months ago",
        "review": "This is going to be pretty long.We were admitted for surgery, which was to be done by the pioneer in laproscopy, Dr. Palanivelu sir. All the paperwork and appointments were taken care of by Pradeepa, who made it hassle-free for us. On the day of surgery, the doctor met us in person and explained the gravity of the situation. He informed us of the various approaches he has planned for this particular case and explained everything in detail. We were more than confident only because our family member is in safe hands. We completely trusted Dr. Palanivelu sir—his skills and expertise. Post-surgery, we again got to meet the doctor, who confirmed everything went well.Post surgery during the recovery phase Dr. Sreeram sir and Dr. Srinivasan sir visited the patient twice every day to make sure everything was fine and the patient was recovering.The nurses who took care of room number 310 will always be close to our hearts. Kabila sister, Soundarya sister, Divya sister, and a few more were always on their toes. Their constant reassurance and their politeness made the post-surgery phase even easier.Above all this, we had food being delivered from the canteen for both the attendee and patient. Although the food was prepared so hygienically, just like home-made food, the person who delivered it made it even more pleasant. We had Muthurasu, who always walked with a smiling face and delivered the yummiest food one can never expect in hospitals.I understand this might look like a staycation review/feedback, but I personally wanted to mention all their names not only to thank them but also to bring them to the limelight so that even their management can be proud of how excellent their staffs have been with their dear patients. Everyone from house keeping team, ward boys and dieticians who visited were were kind and very professional.We also had director ma'am, who took time and visited us on the day of discharge. We then got to know that she visits patients on their day of discharge to get their feedback.On the whole, we would highly recommend Dr. Palanivelu and his team of doctors, nurses, and everyone who works there, as they were all TRUELY GEM!"
    },
    {
        "reviewer_name": "Mohamed Siddik",
        "period": "2 years ago",
        "review": "Kudos to Gem Hospital and staffs! We went multiple Hospital for my mother operation. No one is giving the better hope and fearless admission, the only team is The 'Gem' hospital. We admitted her in very serious condition for Hernia, Coz of many years of illness. Dr bushan and team managed very well.. all the consultants approached very casual with full of positivity.. actually we are much broken, but they given us hope.. After 1week of ICU my mom came with energetic ❤️ Staffs are polite,gentle, humble, caring.Management follows strict covid protocols and good serviceThe restaurant is good. We can get the foods upto 10pmQuick response from room services, 24hrs OPD doctors available. Hospital is Bit costly for treatment but worth for their treatment Hospitality serviceI'll never forget the hospital, the operation room, OPD"
    },
    {
        "reviewer_name": "Karthikeyanc Chandran",
        "period": "5 months ago",
        "review": "Dr.R.Niranjan who has done the hernia operation for my brother successfully and recovered faster and discharge by next day. Explained about procedure on detailed manner over all experiences very good. Entire hospitality and supporting staff are very good."
    },
    {
        "reviewer_name": "karamveer singh garcha",
        "period": "2 weeks ago",
        "review": "I have deep faith in medical treatment when it comes to gem hospital as so many of my family members have undergone surgery at gem and has recovered very well.it was for me I have to get operated for gall bladder surgery right from appointment for palanivelu sir through ms.prathiba who has been in constant touch for a seamless plan of action to the surgery by the almighty himself dr.palanivelu sir . it's been almost 15 years in my life that i am seeing such dedication towards his work and his humble nature makes any operation so worry free.i would suggest anyone planning for a laproscopy surgery to get in touch with gem hospital.you are in safe hands ,well equipped modern hospital,good nursing, properly managed insurance dept..  thank you gem hospital."
    },
    {
        "reviewer_name": "pradeep s",
        "period": "a month ago",
        "review": "Gone for Full Body Executive Health chekup and found satisfactory with the service and promptness to complete the checkups. Thanks for all staff, especially the liasion staff Bharathi in coordiantion with the labs and doctor appointments"
    },
    {
        "reviewer_name": "Prajesh",
        "period": "6 months ago",
        "review": "Dr. Srinivasan did operation for me( Gallbladder removal). He is an excellent surgeon and given much more confident and comfortability. Very good hospitality and doctors and the substaff are all taking care nicely. Thank you so much."
    },
    {
        "reviewer_name": "mosleh uddin",
        "period": "a year ago",
        "review": "Service is excellent and doctors are taking care of patients. Cost is reasonable. Hospital environment is good and floors are clean.Miss Prothiba helps me a lot. She is so kind and supportive."
    },
    {
        "reviewer_name": "Viranjay Kumar",
        "period": "4 days ago",
        "review": "Dr srivatsan sir done the surgery.he is best surgeon and sandhiya best cooperative and good behaviour.all staff very co operative."
    },
    {
        "reviewer_name": "Rajalakshmi A",
        "period": "2 months ago",
        "review": "It was a good experience with Thaara mam. She treated well and take care with love. Her guidance for online consultation was very much useful to me. Thanku mam"
    },
    {
        "reviewer_name": "Vijay Raghunath K M",
        "period": "2 months ago",
        "review": "Recently I went to GEM hospital Chennai and had a minor survey which was very easy and discharged within a day. Special thanks to Senthilnathan sir and Srinivasan sir. Also entire staff was very good."
    },
    {
        "reviewer_name": "EBEN JASKER",
        "period": "2 weeks ago",
        "review": "Very nice team all very very kind made us not to wait it was very easy to get along and discharge in time .Be rocking insurance was very good superb"
    },
    {
        "reviewer_name": "Nithyashree Natarajan",
        "period": "4 months ago",
        "review": "Recently had a laparoscopic surgery by Dr. Delphin Supriya, an excellent endo-gynecologist. The hospitality and management at Gem Hospital, Perungudi, were outstanding. Highly recommend their services for professionalism and care."
    },
    {
        "reviewer_name": "Mumtaj Ayesha",
        "period": "5 months ago",
        "review": "I would like to thanks to Dr.Delphin Supriya for her care and great treatment and hospitality. Also the entire team was very kind and very supportive throughout the admission to discharge. I need to thanks Rashika PRO, nursing who takes care well and she created good bond. Overall I will recommend the Gem Hospital."
    },
    {
        "reviewer_name": "Sujatha Deenadayalu",
        "period": "a month ago",
        "review": "Admitted my mother in gem hospital was the best decision I made Dr sreeram helped us for the surgery and all went smooth Environment and staffs are very good"
    },
    {
        "reviewer_name": "Ayesha Rafi",
        "period": "5 months ago",
        "review": "Service is good. Dr. Rukayyal fathima has performed surgery for me and the service was very good. Dr. Delphine's service was also good. Rasika pro guided me well throughout. Nurses and ward assistants service was also very good throughout"
    },
    {
        "reviewer_name": "Gowtham Sivasubramaniam",
        "period": "3 months ago",
        "review": "I have visited this hospital for my master health check-up. They have provided good care throughout the entire process. Like to thank Nandhini for her guidance and professional ethics throughout the check-up procedure."
    },
    {
        "reviewer_name": "Sirisha Nuvulla",
        "period": "6 months ago",
        "review": "Hello!I am Sirisha.Nuvulla BHMS graduate who unfortunately took corrosive acid intake in the month of january from then i am suffering so much like i couldn’t even swallow my saliva atleast…later with the help of Dr.REVANTH Sir(Surgical oncologist) i took the opinion at GEM HOSPITAL,Chennai by consulting Dr.UMA SHANKAR Sir(MG) and Dr.SREERAM Sir(SG). They had done the necessary investigations and suggested me the surgery which can help me to eat…i am in continuous followup with Dr.SREERAM Sir who had responded so well to the patients…one day the team planned for the surgery and i feel very fortunate as i got operated by Dr.PALANIVELU Sir one of the world’s best surgeon and Dr.SREERAM Sir.I really feel blessed to have this opportunity as the doctors had done there best for me and helped me to eat small amount of food within few days postoperatively. And the hospital staff and the hospital premesis are all so neat and good…Everything was clearly guided by the Prathipa(PRO) and the nursing staff are also the best.Most recommend hospital from my sideThank you."
    },
    {
        "reviewer_name": "GV Angayairkanni",
        "period": "4 months ago",
        "review": "I am Ezhilan.. Recently i am going to this GEM Hopital.. The Caring is well and good hospital and service also good..Gastro Entro department Doctors MR. Senthilnathan sir is a very hood Human Being and best doctor in India then also MR. Umashankar sir and Dr. Swetha madam always take care of every patients and replay to his doubts at any time.. Over all rating is Good."
    },
    {
        "reviewer_name": "Evelyn Ratnakumar",
        "period": "6 months ago",
        "review": "I had a very positive experience at GEM Hospital, Perungudi, where I gave birth to our son. They have a top-notch gynaecology department that is fully equipped to handle high-risk pregnancies like mine. My doctor, Delphin Supriya, was excellent throughout my pregnancy journey and gave me the exact type of birth experience i sought. At the end, she encouraged me even when I was too consumed by pain and motivated me to have a fairly quick and normal delivery. I'm very grateful to her and applaud her kindness, professionalism and exceptional care of me and our baby. OBGYN Dr Nandhini who also played a big role in my delivery had the right things to say to help encourage me to speed up my delivery. A big thanks to her as well. Finally, Dr Harishmitha was around night and day to ensure my vitals were stable and addressed all my concerns. I appreciate her diligence throughout my stay.A special mention of Sister Kannaga from the gynaecology department - from Day 1 of my pregnancy, she has taken care of me everytime I stepped into the hospital. Such a kind and efficient nurse who was always willing to help. Similarly, PRO Rashika helped me and my husband sort through the insurance and hospital stay and ensured we were assigned a room that fully satisfied us. She's a great troubleshooter!The Labour Nurses and Housekeeping took great care of me and my baby. Special mention of Sister Bhuvaneshwari who taught me and husband several important skills to care for our baby as we are first-time parents.Everyone at the Sample Collection department was always helpful.  Similarly the folks at Reception and Billing were kind and warm to us every time we stepped into the hospital and were very invested in our journey. They were thrilled to meet our baby and spend time with him.What we got at GEM was a homey experience with a whole bunch of warm and caring staff-- they always checked on my health and comfort even when they were busy. Truly grateful to everyone and would highly recommend anyone looking for a skilled team to delivery their baby to think no further and head to GEM Hospital, Perungudi!"
    },
    {
        "reviewer_name": "pradeep kumar",
        "period": "5 months ago",
        "review": "Hlo Myself PradeepI can say Dr. Senthilnathan is one of the best surgeons out there when it comes to stomach related issues. Very happy to receive treatment and surgery directly under his supervision. I can recommend him . However, post surgery care in terms of support .all the nurses are good.the one Ms. Meenaktchi mam was helpful during the hospital admission process as this can get tidy sometimes."
    },
    {
        "reviewer_name": "Jagadeeshan Chennimalai",
        "period": "4 months ago",
        "review": "Dr.Umashankar belongs to Medical Gastroenterology is treating patients well.  Ive undergone upper GI endoscopy, the procedure was smooth and no complications or pain. He listened our concerns with patience and treated accordingly.Me and my family satisfied with the doctors treatment.Thanks."
    },
    {
        "reviewer_name": "Ashu Murtu",
        "period": "3 weeks ago",
        "review": "Very good master health check up service from Gem hospital. Staffs are really co-ordinated everything very well. Staff names - Lavanya and Sripriya."
    },
    {
        "reviewer_name": "Anamika Sinha",
        "period": "a month ago",
        "review": "Seamless experience with annual health checkup. No long waits and Sister Bharathi was there to ensure that i never had to wait, she was always there for the next session or test."
    },
    {
        "reviewer_name": "Sweatha s",
        "period": "5 months ago",
        "review": "Dr senthilnathan sir is very kind and gives a good guidance to patients and his PA Pradeepa mam is very good in her conversation and clarifies our doubts very quickly. Good hospitality and good service."
    },
    {
        "reviewer_name": "s.karthika Raja",
        "period": "5 months ago",
        "review": "i have umrical hernia past one year.iam fear about surgery. I went to gem hospital and met Dr.pinak dass Gupta he was explained about surgery. The way of talking and handling the patient situation was very nice. After the surgery the care was excellent. expecialy the doctor s team was fabulous.and the staffs taking care each patient was nice.thanks to God and whole gem hospital team.special thanks to IP MANAGER/OT STAFF/ WARD STAFF S& HOUSE KEPPING TEAM & PHARMACY"
    },
    {
        "reviewer_name": "Arunkumar",
        "period": "6 months ago",
        "review": "I have been to the GEM Hospital first time today for my Health Checkup(through Corporate). Hospital was very neat and clean with good infrastructure. From the registration to complete checkup process the staffs guide me very well with polite gesture. I never seen a doctor saying apology for delaying a patient that too not long just for a 10mins. All the staffs were so humble to patient's, their hospitality is very good! Keep it going! Kudos to the team!"
    },
    {
        "reviewer_name": "murugesan L",
        "period": "2 months ago",
        "review": "Dr srinivasan mani given best experience very satisfied.Special thanks to sandiya. She is very caring and take a good care always given positive vibes."
    },
    {
        "reviewer_name": "anu varshini",
        "period": "4 months ago",
        "review": "Greetings!!I had been here for my laparoscopic surgery.GEM hospital is an excellent place to get it done.I would like to appreciate and thank Dr Ramya sridharan,Dr Delphin, Dr Gayathri for their excellent support and guidance in treating me,Nurses( priyanka, narmatha, gomathi especially for taking a good care of me),staff Rashika for her support and housekeeping staffs for keeping  the environment neat and clean!!!The food provided by the canteen were also upto the mark!!!"
    },
    {
        "reviewer_name": "NAGA MANI",
        "period": "5 months ago",
        "review": "I recently had consultation for gall bladder stones and followed by surgery done by Dr Mr.Senthilnathan. He was so patient and clearly clarifying each and evey doubts most importantly he is building up a steady confidence in patients that they will recover soon. He is down to earth person. He explained the complete procedure to us and the recovery time which went as per his word.His  Secretary Ms. Prathiba was patient and kind enough for facilitating in possible ways"
    },
    {
        "reviewer_name": "dinesh kumar",
        "period": "8 months ago",
        "review": "Good services. All staff and nurses are so much kind during the treatment. Frequently ensuring the patients comfort and doing the needful.Doctor SRIVATSAN sir, Thank you so much for taking care during surgery and follow up after surgery which made me feel confident and better for my recovery ."
    },
    {
        "reviewer_name": "tejeswar reddy",
        "period": "5 months ago",
        "review": "My father was suffering from lower abdominal pain(the rectum side), we have gone to local hospitals but never helped, one of my father's friend recommended this hospital, the staff were really attentive, ambiance was great, we have consulted dr.pinak dasgupta sir, he made up clear what the problem was, and my father undergone a 45 min surgery (the latest laser technology), the residential room was great too, we have 24 hrs hot water,  good assistance. Every thing was great."
    },
    {
        "reviewer_name": "Jawahar Pasupathi",
        "period": "5 months ago",
        "review": "I came for treatment of abscess releif. Dr. Pinak suggested minor surgery. The surgery was quick as well as the recovery post surgery. They took care of me well. The entire process was smooth. Highly recommended for colorectal/ hernia treatment"
    },
    {
        "reviewer_name": "Ezekiel Sam",
        "period": "a month ago",
        "review": "This hospital has the best receiptionist team I would like to congratulate everyone especially Bhuvana, Abinaiya, Lavanya for their sincerity and always smiling face. All the very best keep serving people and God will surely reward you for that."
    },
    {
        "reviewer_name": "kannan P",
        "period": "a month ago",
        "review": "Taken treatment under Dr Pinak for fistula.. The treatment is very good.. Best Wishes to Dr Pinak and his team..ThanksDr P Kannan M Tech, Ph D.,"
    },
    {
        "reviewer_name": "Sivaraj Dorairaj",
        "period": "8 months ago",
        "review": "I had my master health check-up done in GEM hospital and it was my first visit to this hospital. Right from registration to the delivery of reports and consultation, the service quality was top-notch. You get a person assigned to guide you through the complete process and they do their job very well. The hospital is clean, maintained very well with a good canteen. I would gladly visit again in the future for the service and professionalism.  Insurance processing was quick and seamless.A special thanks to S Deepa who helped us."
    },
    {
        "reviewer_name": "Arvind K V",
        "period": "3 weeks ago",
        "review": "Good and satisfying experience with health check up and tests taken by the doctors and staffs and staffing process was done good by Lavanya Sripriya.."
    },
    {
        "reviewer_name": "Kishore Chand",
        "period": "a month ago",
        "review": "I am very much impressed with the service provided by GEM hospital Perungudi, especially sisters Ms.Deepa and Ms. Bhuvaneshwari who rendered good support."
    },
    {
        "reviewer_name": "SK DÎVYÊSH",
        "period": "4 months ago",
        "review": "I have visited Dr.srinivasan mani for my wife Fisher problem.Dr.srinivasan mani kindly explained the problem and suggest for a minor operation.procedur is done properly and my wife is cured quickly.Neat and good hospital, nice environment,good doctors and nice kind staff nurse.Thanks Gem Hospital Team.."
    },
    {
        "reviewer_name": "Deepak Sanghi",
        "period": "3 months ago",
        "review": "They take care of patients with utmost care. The staff is very courteous and professional. Their insurance claims processing department does a flawless job."
    },
    {
        "reviewer_name": "NATESAN PALANIPILLAI",
        "period": "6 months ago",
        "review": "I am P. Natesan. Came for Cholecystectomy. Dr. Senthil Nathan and his team performed the surgery. The very first day I met Dr. Senthil I came to the conclusion that he is very professional in his approach.The team of doctors, nurses and other staff are very courteous.  The hospital service is very systematic and professional.Regarding the patient food, it is served is plastic containers and disposable cups. It is not environmental friendly. Please change to traditional washable containers. The extra cost may be borne by the patients."
    },
    {
        "reviewer_name": "Jaisankar Venkatraman",
        "period": "5 months ago",
        "review": "Excellent diagnosis, care and treatment by Dr. Delphin Supriya. Explained the pros and cons of the procedure patiently and facilitated an informed decision. Strongly recommend her for gynae problems. Very good service by Ms. Rashika. Kind, courteous, polite and helpful. Overall excellent service at GEM Hospital, Perungudi."
    },
    {
        "reviewer_name": "Manoj Kumar",
        "period": "5 months ago",
        "review": "I would like to commend Pratheba at Gen Hospitals for her exceptional service and attention to customers. She is truly a professional who goes above and beyond to ensure patients receive the best care."
    },
    {
        "reviewer_name": "Yousuff Mohamed",
        "period": "7 months ago",
        "review": "My wife has been admitted to this hospital for surgery. The service provided by Gem hospital has left me very satisfied. This is my first time visiting this hospital. Their hospitality was really appreciated. All staff members are highly responsive and performing their best work. My wife felt like she was at home because of them. The rooms were very well maintained. Especially Mrs. Padma and Priya were very helpful throughout the process. They are very kind and polite.Thanks for the overall experience."
    },
    {
        "reviewer_name": "Swarna Latha Nasika",
        "period": "3 months ago",
        "review": "Deepa sister is very much supportive and ensured the entire health check up process is completed without any waiting time. Thank you so much for the great support."
    },
    {
        "reviewer_name": "Princy jose",
        "period": "6 months ago",
        "review": "Very good hospital for Gastroenterology, I am visiting Dr. Uma Shankar continuously for IBS, he is listening to all my problems with very patience. Not hesitating to spend time to hear patient's symptoms and problems. Explaining things with a calmness. All staffs are responsive and friendly."
    },
    {
        "reviewer_name": "Rajarooban Raju",
        "period": "3 months ago",
        "review": "Admitted in GEM for Hernia Treatment.. Surgeon Dr Pinak Das Gupta.. Explained well before the surgery... Such a wonderful doctor... Hospitality and food were excellent.. Nurses were caring in nature.. And our PRO Miss Kowsalya was very helpful.. Tnk u .. Overall a woderful experience.."
    },
    {
        "reviewer_name": "Amsalekha kumar",
        "period": "5 months ago",
        "review": "Excellent care by Dr. Niranjan and team. Lap Chole and ERCP procedure carried out and recovered in less than 3 days. Staff were very cooperative and made patient feel like home..God bless!"
    },
    {
        "reviewer_name": "Aravind Ramesh",
        "period": "5 months ago",
        "review": "I was blessed 😊 to get admitted and get treated in GEM HOSPITAL 🏥...  Excellent nursing.. Top class facilities.. God bless Mr. Dr Ajay.. Who made me to return to normal life... PRO - Kousalya, Very friendly and approachable at any time...  This isn't an hospital it's a temple where are problems gets resolved.. Thank you GEM HOSPITAL.. Special note - Thank you Dr. Vaanmathi Anesthestis... Very Kind..."
    },
    {
        "reviewer_name": "vasanthi chandrashekhar",
        "period": "5 months ago",
        "review": "The best care,very good nursing staff round the clock, Dr Pinak and his great team were very efficient and took good care .Thank you Doc.Hospital  rooms were neat and clean, Food quality  is good."
    },
    {
        "reviewer_name": "Priscilla Andrew",
        "period": "3 months ago",
        "review": "The corporate health checkup package was very good. Happened systematically and without any delay. Thanks to Nurse Nandhini for her help throughout the day"
    },
    {
        "reviewer_name": "ramky007in",
        "period": "a month ago",
        "review": "Went to gem hospital perungudi for master health check upExcellent coordination work done by bharathi, srrepriya and nandiniDespite huge crowd they kept their calm and guided all patients on timeThey were able to ensure within 5 hours whole process gets done smoothlyThank you staff and gem hospital"
    },
    {
        "reviewer_name": "April Summer",
        "period": "3 months ago",
        "review": "We were here for an operation for my father. From start to finish excellent care given by the staff here. Special thanks to Dr. Niranjan and Dr. Asokan for their patience and their skilled procedures."
    },
    {
        "reviewer_name": "Janani saravanan",
        "period": "4 months ago",
        "review": "Good hospital with caring and support...Special mention and  thanks to Dr.Nandhini Gyno for her patience and clear explanation    about surgery...All staffs very responsible and done their job with smile..."
    },
    {
        "reviewer_name": "Sornavalli V",
        "period": "6 months ago",
        "review": "I was treated by Dr. Senthilnathan for cholelithiasis. Laproscopic cholecystectomy was done. The doctor was very patient and friendly, nurses were also excellent. Surgery was done promptly with no post op complications. Highly recommend this hospital."
    },
    {
        "reviewer_name": "suraj hial",
        "period": "6 months ago",
        "review": "Heard about this hospital from one of my friend and walked in for a check up for an ongoing stomach pain, found out I have a 2cm GB stone. So go it operated and I’m fine now.But that’s not the thing, the important thing about this hospital is, how hospitable they are. Starting from day one till the last review they have been amazing.. so process had any chaos or ambiguity but it was all smooth like butter. Every staff are well trained and their behaviour towards each other and patient are always polite.A special thanks to the surgeon Dr. SRINIVAASAN MANI, who was extremely polite and helped me understanding the whole process and clarified all my question (sometime as silly as if I can eat this Dal or that dal) with utmost patience. Thank you Doctor."
    },
    {
        "reviewer_name": "SHANTHI RAO",
        "period": "4 weeks ago",
        "review": "A few friendly and helpful staff made our experience very smooth. Special mention of Ms. Jeevapriya, Mr.Arul, Mr.Ashok and Dr Aravinda Narasimhan for their efficient and kind guidance"
    },
    {
        "reviewer_name": "Rajesh K",
        "period": "6 months ago",
        "review": "Experienced Doctors with good treatment Dr Senthil Nathan sir treated well for fissure with patience laproscopic surgery and advised wellExcellent extra care by all doctors, all attendees, service staffs. Peaceful experience in hectic health issue. Special thanks to Dr Senthilnathan. His service to humanity is highly appreciatedSpecial thanks to the insurance team of the gem hospital for the support given to get full cashless service as personal care.Insurance departments timely support given.Will recommend for others toothanks to GEM hospital & Team"
    },
    {
        "reviewer_name": "bala subramanian",
        "period": "5 months ago",
        "review": "Review about our beloved doctors the embodiment of GEM hospital.I don't find adequate words to express my sense of gratitude to the doctors team of DR.PINAK DASS GUPTHA and Dr.REJIV for having given the treatment with a systematic study of the patient and the treatment to the  core of excellence with highest dedication,etiquette, with the great intention only to make them get cured. It is my greatest responsibility to thank all the doctors associated with them to take the utmost care to get recovered at the earliest.God is creating the nature and the life but these doctors save their life when it is at rescue. I pray the almighty to give a long happy healthy life forever to the eminent doctors to serve in the medical field  to our nation with latest technology and updates to compete with the other countries.I pray the almighty the hospital GEM becomes the gem of the hospital in the nation.S BALASUBRAMANIANHM RETDSRV SCHOOL RASIPURAM"
    },
    {
        "reviewer_name": "Wego Somu",
        "period": "a month ago",
        "review": "Dr senthilnathan sir was very kindly and with at most care our surgery was successful thank you sir for your kind words staff are very polite to us"
    },
    {
        "reviewer_name": "Kannan Er",
        "period": "6 months ago",
        "review": "All peoples like Doctors, Nurses, cashier, Receptionist,& other service persons have done their duty very sincere & dedication. Really appreciate the chairman doing his roll perfectly. And I am very thankful to Dr Srinivasan and his team."
    },
    {
        "reviewer_name": "Srinivasan Thiagarajan",
        "period": "6 months ago",
        "review": "Underwent laparoscopic surgery(Heller's myotomy) for Achalasia cardia...Dr. Senthilnathan performed the surgery. He explained the surgery very well patiently before the surgery was scheduled.Pre operation checks got completed like clockwork. The rooms were very nice, clean and professionally maintained. The nurses, attenders and administrative staff were very courteous, friendly and super efficient which is a rare combination.The operation was done on schedule. Special shout out to Anaesthetic experts who managed my cl-3 extremely well.Post op support was also very good with excellent support from nurses, dieticians, canteen staff, admin assistants and cleaning staff who were very professional. We did not have to remind anything.Doctors kept coming regularly to reassure my progress and clarified all our doubts.We sincerely thank the Dr. Senthilnathan sir and his highly efficient team for all the great work."
    },
    {
        "reviewer_name": "Iniyaval Sweety",
        "period": "a month ago",
        "review": "I was nicely treated and had good full body health checkup in this hospital, overall cleanliness and doctors were so good and I had been taken care of good by Ms.Bharathi"
    },
    {
        "reviewer_name": "Srikanth MR",
        "period": "7 months ago",
        "review": "My recent checkup at Gem Hospital turned out to be a positive experience despite initial anxiety. The staff's hospitality was warm and welcoming, putting me at ease. The wait time was minimal, and Dr. Harri Prasad impressed me with their clear explanations and accurate diagnosis. Additionally, the hospital provided excellent support in navigating the insurance process. All in all, a top-notch experience!"
    },
    {
        "reviewer_name": "KARAN (_06)",
        "period": "4 months ago",
        "review": "Nice hospitality❤️...we came here To Get a solution for Abdominal Adhesion ... They Provide a Solution Immediately.After That  The Doctor & The Nurse's or very polite and Well Care take To Their patient's ❤️‍🩹...And more Over The food & Cleaning is also very GooD👍...Gem Is not only in the name of the hospital....Ever Doctor's & Nurse's are like 💎 #gemhospitalperungudi"
    },
    {
        "reviewer_name": "Prakash Chowdary",
        "period": "a month ago",
        "review": "I had health checkup today in GEM hospital in Perungudi. The co ordinaters Bharathi and Bhuvaneswari us kind and very helpfull."
    },
    {
        "reviewer_name": "Wanderer",
        "period": "a month ago",
        "review": "Great one for Gastro, I was here for my cousin's harnia surgery, everything was fine good. This one will be considered as Chennai's best for Gastroenterology..."
    },
    {
        "reviewer_name": "Balasubramanian",
        "period": "7 months ago",
        "review": "We consulted Dr. Srivatsan for hernia treatment of my father in law (age 84). He is well experienced and took good care and did laproscopy surgery successfully. The patient care is very good. Nurses and other staffs are very helpful and took good care of patient. Excellent facilities and infrastructure. We are very much satisfied overall."
    },
    {
        "reviewer_name": "im back",
        "period": "7 months ago",
        "review": "Thank you for helping in endoscopy procedure. Appreciate all the great work by doctors, nurses and all support staff. Everyone is courteous and helping. Great work.Few areas of Improvement:1. Ward boy not available for more than 30 minutes to move the patient from operation theatre to room. Proper coordination will help to avoid these cases as the patient suffered heavily because of waiting time outside operation theatre.2. Insurance coordination can be better. Even after informing about this, nothing helped. Proper coordination between billing, room and insurance needed."
    },
    {
        "reviewer_name": "Parthiban M",
        "period": "6 months ago",
        "review": "Very Good Hospital for Gynaecology. Hospital and environment was very good and they provide the excellent service and care and my experience in the hospital was very good.Underwent for the conservative management on emergency admission. Thoughtful and quick decision by Dr.delphin dr.Nandhini  was very helpful and  Hospital nurses as well very good and nice service and special thanks to Rashika PRO and for kanaga sister and nandhini sister.Rooms are well maintained and clean.Thank you GEM."
    },
    {
        "reviewer_name": "Raj Prabu",
        "period": "6 days ago",
        "review": "Excellent infrastructure, peaceful , well cleaned and thanks to Bharathi and Parameswari sisters for the help and excellent service , keep it up"
    },
    {
        "reviewer_name": "Vandhana CB",
        "period": "3 months ago",
        "review": "Consulted Dr. Niranjan for a treatment, he was polite, explained the process clearly and did the procedure to utmost satisfaction. Very goodtreatment with helpful, friendly staffs."
    },
    {
        "reviewer_name": "Sagar Naik",
        "period": "3 months ago",
        "review": "I have gone through a colorectal surgery at gem hospital Chennai, this hospital works very much professionally and the care taken by doctors and nurses is remarkable and i would like to thanks to all the doctors ,nurses, wardboys, cleaners and everyone who are associated with the hospital and working very much consciously to make every step fruitful for the patient'sThanks gem Chennai,Jai siyaram 🙏"
    },
    {
        "reviewer_name": "Janani Barani",
        "period": "5 months ago",
        "review": "My mother under gone a uterus removal surgery  done with lacroscopy technology and the surgery successfully completed thanks so much ramya doc and delfin doc.so my mother is feeling good now,the hospitality of gem hospital is outstanding,thank you so much each and everyone especially staffs nurses and the food was good special thanks to Dr.ramya mam she is so kind.i will definitely suggested to my frnds and family."
    },
    {
        "reviewer_name": "Kutty Suji",
        "period": "5 months ago",
        "review": "Recently I admitted this hospital for piles operation,I fully satisfied about their treatment, because I checked more hospitals for my treatment but operation cost is very higher than I expected,but in Gem hospital one time I visited their free camp in medavakkam,their I got best price for my treatment.Finally treatment happened I feel good,thank you Gem hospital"
    },
    {
        "reviewer_name": "Imtiaz Rizwan",
        "period": "4 months ago",
        "review": "My sister in law was admitted in gem hospital for fever and stomach pain in this period doctors and staff are very kind and gives very good treatment, she is recoverd well and discharged. Very much recommended"
    },
    {
        "reviewer_name": "Rosemary Yobu",
        "period": "6 months ago",
        "review": "My name is Yobu, and I was receiving care at the GEM hospital in Kandanchavadi. I'm having some stomach problems. Dr. Pinak sir performed a little operation on me. I have never seen such a wonderful doctor and caring guy as him before. Excellent experience. I received amazing care from all of the physicians and nurses, especially PRO. Mrs. Meenakshi was an incredibly helpful and nice woman. She has only ever taken care of us. She assisted us during night emergencies and spent a lot of time with us. Many thanks to all of you. We would want to thank PRO Mrs. Meenakshi and Dr. Pinak sir once more. Excellent experience at the GEM Medical Center."
    },
    {
        "reviewer_name": "thilahavathi narayanan",
        "period": "3 months ago",
        "review": "I met Dr.Ramya sridaran and Dr.Delphin for a surgery. Hospitality and services was so good. I am doing well now thanks to gem and doctors."
    },
    {
        "reviewer_name": "Madhu Rubini",
        "period": "6 months ago",
        "review": "All the staffs and receptionist are very understanding and friendly. Receptionist Abinaya was very kind to me and she treated us well. I am satisfied with the treatment ,I've been consulting Delphin Mam & Nandhini Mam, they are very down to earth and understanding..I liked overall ambience and had a good experience in Gem Hospital..Most Recommended.."
    },
    {
        "reviewer_name": "Shila Mondal",
        "period": "6 months ago",
        "review": "This is the best Hospital for gynaecology. the gynaec department was very good. They gave me a excellent service with international equivalent service. It is very good and personal experience for me. the housekeeping, nursing and doctor all are very well professional, trained and excellent in service. I moreover do see the place as home than a hospital. Especially I need to thank Dr.Nandhini and Dr.Delphin. the most finest doctor that God had blessed for me. And I need to special thanks for Rashika PRO who take care me and guide me from the whole journey of this hospital stay. I will recommend her most. thank you rashika for wonderful guidance. would definitely recommend GEM HOSPITAL."
    },
    {
        "reviewer_name": "Dhivya V",
        "period": "6 months ago",
        "review": "The hospitality and services provided by Gem hospital is very good and highly appreciated.Thanks to Dr.ajay and team for taking good care and support for quick recovery.Staff members and nurses were responsible.The rooms were very clean and infrastructure was good."
    },
    {
        "reviewer_name": "Sendil Kumar",
        "period": "4 weeks ago",
        "review": "Best hospital, best staff, very hospitality. Bhuvaneswari is very kind. Dr senthil Nathan sir is very excellent. Regards"
    },
    {
        "reviewer_name": "Rama Lingam",
        "period": "6 months ago",
        "review": "Dr.Swetha.I really need to thank Dr.Swetha Mam for her treatment to my father on liver cirrhosis. We are visiting this over an year, The entire team response during this period was too good and prompt. As my dad become strong both physically and mentally now. Thanks again for the Doctor and her team."
    },
    {
        "reviewer_name": "Marimuthuraj M",
        "period": "6 months ago",
        "review": "Excellent treatment given by the doctors Mr.Sanoop and Mr. Vinoth kumar (chief doctor).My maternal uncle was admitted due to Acute liver failure ., Doctors were kind enough in consulting us each and every single thing and started the medications.., with 4 continuous PLEX my uncle started to respond well and discharged within 7 days. He is now at home but needs to be under close follow ups for next 3 months.Special mention about the nurses too, they were so deductive, kind and provided very good care throughout.I would strongly recommend this hospital for my dear and dear ones when they are in need.Thanks Team Gem 🙏🏼💐"
    },
    {
        "reviewer_name": "Bharath Sampath",
        "period": "a week ago",
        "review": "Great experience... Doctors were very clear in explaining things.. overall very happy"
    },
    {
        "reviewer_name": "Poorani sree",
        "period": "6 months ago",
        "review": "The hospitality and services provided by Gem hospital is very good and highly appreciated.Thanks to Dr .Palanivelu sir & Dr. Sree Ram sir and his team for taking good care and support for quick recovery ofMy mother - Subbulakshmi )Staff members ( PRO Prathiba, Meenakshi ,Syinthia)-  and nurses were good response.The rooms were very clean and infrastructure was good.regardsMANICKAVASAGAM"
    },
    {
        "reviewer_name": "Manickkam Pandian",
        "period": "a month ago",
        "review": "Dr. Senthil Nathan was very friendly and making my dad very comfortable during the hernia operation."
    },
    {
        "reviewer_name": "Geetha Ramani",
        "period": "3 months ago",
        "review": "Dr pinak sir treatment is very excellent. All doctors also it's very nice. Thank you so much Gem is 💎"
    },
    {
        "reviewer_name": "Kala Hannah Francis",
        "period": "9 months ago",
        "review": "Compared to few private hospitals in Chennai I would rate Gem hospital as one of the best (even above Apollo). I have been coming here for the last 2 1/2 years and would say so far never had any complicated issue. The extra friendly staff and doctors make the hospital feel like home in care and concern."
    },
    {
        "reviewer_name": "Kaviya Deena",
        "period": "6 months ago",
        "review": "This is the best Hospital for gynaecology. They provide a good care and excellent service. It was very personal experience with my mother. I need to thank nurses, housekeeping and Dr.Delphin, Dr.Nandhini and Dr.Harishmitha mam all are very well professional, trained and excellent in service. Especially i need to thanks Rashika PRO and Nandhini and Kanaga Sister. I would definitely recommend GEM Hospital. Thank you God."
    },
    {
        "reviewer_name": "Samar Baroi",
        "period": "6 months ago",
        "review": "The GEM Hospital is very best for all the treatment. We are came from Andaman and Nicobar Islands,I have got all the treatment benefits as like service of patients dieting, medicine, nursing and doctor consultations, and also provide patient Room service .the medical climate is very best for any types of patients disease.Our Doctor Mr.Sreeram Sir and Doctor Senthil Nathan Sir are best treatment provide in this hospital. I'm great full to both Doctors for treatment of my wife,and also great full to all Sisters of this hospital.thankyou."
    },
    {
        "reviewer_name": "Sumathy Muralidharan",
        "period": "4 months ago",
        "review": "Dr. Senthil was bestPro ms. Sandya was very nice in her speechGood reception , good nursing and good food for the patient and for the attender .Over all good hospital"
    },
    {
        "reviewer_name": "Swaminathan Palaniappan",
        "period": "6 months ago",
        "review": "We had been here for my Wife’s laparoscopic surgery. The Dr. said it is the best place to get it done. The hospital lived up to the expectations. It was a hasslefree experience with the admission, surgery and discharge. Good care shown by doctors, nurses and dietician, including explaining details and giving good comfort to feel confident.Couple of improvements: Vidal TPA is not being done cashless. I had to pay and claim. Learnt that the hospital had a finance partner for this but we did not use them.Still appreciate the insurance team for prompt help with the guidance and filling up the forms for my claim.Housekeeping/bathroom cleanliness is next to perfect. I had to call the housekeeping and request for cleaning so as to get a good standard of cleanliness in the room.Cafeteria provides good and clean food for patients and attenders. However use of plastic containers for daily food to patients must be avoided in these go green/environment friendly requirement days. Please consider using tiffin carriers or hot packs."
    },
    {
        "reviewer_name": "Pavithra",
        "period": "3 weeks ago",
        "review": "Nice experience in Gem hospital.Every staffs in Gem hospital guided me for health checkup so well. Nice consultant from doctors."
    },
    {
        "reviewer_name": "susila rajaraman",
        "period": "2 months ago",
        "review": "Iam in customer delight. This hispital solved my decade old problemThanks to Dr. Hariprassad for all his suppot. Regards to  surgeonDr. Pinak DasGuptha   and his tram🙏💐"
    },
    {
        "reviewer_name": "Susai Mary",
        "period": "4 months ago",
        "review": "My Uncle ,he is known case of DM,SHTN,he got admitted  in GEM HOSPITAL  for 4 days under Dr.Babu narayanan  ,the way Dr.Babu's explanations ,professionalism and patient service...extremely helpful  and I was completely impressed,And Dr.Babu sirs assistant doctors service also amazing  and outstanding, the way  giving treatment ,rounds and follow up measures provided....Really I got quality of care and service received from GEM hospital 3rd floor staff nurses and other helpers, housekeeping  staffs keeping clean regularly and attending immediatelyThank you sir.... now my uncles BP and SUGAR values are normal ....."
    },
    {
        "reviewer_name": "Mubina B",
        "period": "6 months ago",
        "review": "I need to take a moment to express my gratitude towards gem hospital for your exceptional care and expertise in treating my mom during her battle. Your dedication, skills, caring and compassion undoubtedly saved her life, and for that, our entire family will be forever grateful towards gem and for Dr Nandhini & Dr Delphin for excellence care provide to my mom. Thank you so much to all the doctors who saved my Mom and Special thanks to Rashika PRO for everything you did for us and for your total guidance from admission to discharge ✨️ thank you Gem💎"
    },
    {
        "reviewer_name": "Anbu T",
        "period": "a month ago",
        "review": "Dr pinak dasgupta treatment is very satisfied. Thank you so much dr. Staff also very well done."
    },
    {
        "reviewer_name": "Usha Ramanathan",
        "period": "6 months ago",
        "review": "Dr. Srivatsan Gurumoorthy is very cordial and supportive. He and his team of doctors are very nice. The nursing staffs, technicians are very soft spoken and supportive. The ambience is very good and the room is very neat and clean."
    },
    {
        "reviewer_name": "Jonna Arpitha",
        "period": "2 months ago",
        "review": "Dr.Pinac Dasgupta had done the surgery. And the hospitality was very good. They treatment is good."
    },
    {
        "reviewer_name": "Charu Velmurugan",
        "period": "6 months ago",
        "review": "Dr Srinivasan ManiWe are very Thank Full to Dr. Srinivasan  Mani and for his whole     'S-Team' ( Dr.Senthilnathan,Dr.Srivatsan and Dr. Sreeram).It's not God who saved our life but  it was saved by  Dr. Srinivasan . Last but not least Dr. Srinivasan  Mani is One of the real Gems in GEM HOSPITAL.THANKS  & REGARDS,- SARADHA  VELMURUGAN.&- NAVEEN KUMAR J."
    },
    {
        "reviewer_name": "Ravi",
        "period": "7 months ago",
        "review": "My father-in-Law aged 90 Years with Stage 4 Stomach Cancer was Admitted in Perungudi Hospital and diagnosed as he can live for 3 Weeks to Max 3 Months.He passed away *Peacefully* on 22nd May, after 2 months of followup treatment from Gem of Doctors from Gem Hospital - Perungudi. During 2 months of period he was admitted only 2 times (6 Days + 3 Days = 9 Days) and visited Emergency Care Twice.I am really lucky to treat my father-in-law in Gem Hospital as they never did anything (Admission, Treatment, Medicines) for money and treated with the highest form of moral ethics. I have been told by the Doctors that they do not want the patient to suffer in the ICU and they ensure the patient lives without much discomfort.  My father-in-law has suffered only for one night, as he became so weak and could not respond to us and passed away peacefully.The moral support provided by each and every Doctor, Nurse, Front Office Staff and all other employees was excellent.  It would have been a nightmare for us without their excellent medical care and moral support. We strongly felt that we were handled by our own relatives.Thank You very much to the entire Gem Hospital - Perungudi Team from all our family members."
    },
    {
        "reviewer_name": "Vetri Mathi",
        "period": "2 months ago",
        "review": "I m admitting at last saturday for my abdominal problem. Dr. Ajay surgical department handled me. Very neet and clear treatment. I give 100 star to Dr. Ajay. Neet and clear Hospitality."
    },
    {
        "reviewer_name": "Viji Thiyagarajan",
        "period": "7 months ago",
        "review": "I have under a surgery yesterday. The service they provided in the gem hospital was too too Good and the level of care and treatment was provided to me was good and excellent. My expectations was fulfilled. That I have received the best possible care. The team's approach towards us was truly nice, as their support, love, and care to ensure our satisfaction. Dr Delphin Supriya was gave me a good and wonderful treatment. I would like to express our heartfelt gratitude to the entire team at Gem Hospital for their exceptional service and special thanks to nurses and Rashika PRO."
    },
    {
        "reviewer_name": "hari haran",
        "period": "a month ago",
        "review": "Patient name Mr. Shanmuga sundaram op staff bhuvaneshwari & 1 floor staff jeevapriya both guided me well I'm happy to continue this hospital"
    },
    {
        "reviewer_name": "S VISWANATHAN IYER",
        "period": "6 months ago",
        "review": "1st on 3.1.2024 I came to GEM HOSPITAL for quarterly check up of my Cirrhosis treatment. Then Urine problem Thyroid problem Parkinson at Las I had operation for Hernia. Today I came here for most operation preview. Since 3.1.2024 several times I came to this Hospital for treatment. Every time our Doctors Dr. S. Srivathsan Gurumurthy, Dr.Uma Shankar Dr Vinod Kumar Dr. Babu & all other Doctors & Nurses staffs approached to us a family member give respect love & affection. I am really fortunate that I get a Very Very good hospital for getting treatment for all my diseases. I am so thankful to them Particularly it's Founder Dr.Palanivelu ji. My heart felting thanks & Namaskarams to all of them. I pray our God & Goddess Gowri+ Shankar ji shower them victory in all their efforts to fight & save their patients who ever come to them for treatment. ON THE DAY OF DOCTORS DAY TODAY OUR BEST WISHES TO THE DOCTORS & GEM HOSPITAL."
    },
    {
        "reviewer_name": "Agnel Suresh",
        "period": "a month ago",
        "review": "Good service Dr Babu narayann and Dr.Nithya  satisfied consultation. All staffs are good and kindly co_Ordinate  with patient side"
    },
    {
        "reviewer_name": "LEVE ANTONY M",
        "period": "5 months ago",
        "review": "Dr.Srinivas Mani done a excellent surgery of Gallbladder stone issue. Nice staff & taking responsible for entire process.M.Leve Antony.Pallikaranai"
    },
    {
        "reviewer_name": "udhaya udhai",
        "period": "3 weeks ago",
        "review": "The staff here are very friendly and giving proper guidance especially Lavanya and Sripriya are very friendly and supportive. Overall its a good experience for me here."
    },
    {
        "reviewer_name": "sopna balu",
        "period": "4 months ago",
        "review": "Myself undergone laparoscopic surgery for gallbladder stone by Dr. Pinak Dasgupta Sir. The Doctors and the staffs extended their fullest care and support ."
    },
    {
        "reviewer_name": "Anand Muthu",
        "period": "7 months ago",
        "review": "I would like to thanks to Dr.senthil nathan for his humbleness and great care and hospitality. His clear explanation about the surgery made our life easy.  Also the entire team was very kind and very supportive. Especially sumathi ( Nurse) who takes care well and she created good bond. Overall we never felt like hospital."
    },
    {
        "reviewer_name": "sasi dharan",
        "period": "8 months ago",
        "review": "Had done master health checkup for my father. Excellent patient experience and they gave good care and clarity over every detail.Attender Ramana handled everything and directed us for further steps without wasting any time. Totally good experience with little turn around time. Would recommend for a positive health checkup experience"
    },
    {
        "reviewer_name": "Nivan Raj J",
        "period": "6 months ago",
        "review": "Very Good Hospital . Very very helpful front office staff . This is one of the Best Hospitals in Chennai . They guide you all through the entire consultation. From Front office to Doctor Visit . All the Doctors are very experienced. They give perfect treatment. The main advantage of the Hospital is its correct and accurate diagnosis."
    },
    {
        "reviewer_name": "anuradha seth",
        "period": "6 months ago",
        "review": "I am very thankful to dear sir Dr. Palanivelu for successful surgery of me and my brother. No doubt he is the best laparoscopic surgeon in this country. I Will always recommend to everyone for successful surgery. I show my heartiest gratitude to dear sir Palanivelu and his team. I am also thankful to Dr. Sriram and sister Pratibha for taking care of my brother. With warm Regards.Anuradha SethJalandhar City."
    },
    {
        "reviewer_name": "Manoj T",
        "period": "7 months ago",
        "review": "I consulted Dr.Asokan sir for my fissure treatment and he recomended Dr. Ajay Pai for treatment of fissure and underwent a surgery 2 days back. Excellent care was taken by Dr. Ajay and his team, nursing staffs. Special thanks to Asst. anaesthesia (Andrews) for taking good care while the surgery was in progress. The hospital has excellent facilities, neat and clean room and all the services are offered at a reasonable price. Overall a very good experience, thanks to all the doctors, nurses and hospital staffs for the care taken."
    },
    {
        "reviewer_name": "Vandana Shubramaniyan",
        "period": "7 months ago",
        "review": "Thank you to Dr Babu sir and his team for their excellent care! They are always very reliable and trustworthy and special thanks to Dr Nithya mam for her incredible support!My family and I are grateful to have found a good hospital with remarkable doctors and support staff."
    },
    {
        "reviewer_name": "Kevin Arundale",
        "period": "3 months ago",
        "review": "Dr Pinak, PRO Vijay And Kowsalya... All the doctor nurse and staff are well supportive during my surgery.... Thank you Team for continuous support...."
    },
    {
        "reviewer_name": "revathi priyadharshini",
        "period": "3 months ago",
        "review": "Emergency 24X 7 offer good service for injury related emergencies. Dr. Aadarsh did a good job in treating my wound when i came to the hospital on an emergency."
    },
    {
        "reviewer_name": "AC VENKATESHAN MUDALIAR",
        "period": "4 weeks ago",
        "review": "Dr Niranjan  treatment is very well. Thanks for treatment. Highly recommend to treatment for gem hospital."
    },
    {
        "reviewer_name": "IMRAN KHAN",
        "period": "6 months ago",
        "review": "I am 36 years old Imran Khan I was admitted to the hospital with a very bad condition and they underwent dialysis and underwent kidney transplants and now I am doing well and living happily with my family in the hospital, clean care, care, dedication, carefully and the medicines. Five star status for safe handling healthy food water especially thanks to Dr. Balamukundan and ICU nurses OT team and Gem Hospitals Perungudi"
    },
    {
        "reviewer_name": "Veni Palanisamy",
        "period": "7 months ago",
        "review": "\"\"Dr. Srinivaasan Mani is excellent and incredibly approachable. His positive attitude and effective treatment plan helped me recover quickly. He took the time to listen to my concerns and provided a thorough explanation of my condition. Highly recommended!\"\""
    },
    {
        "reviewer_name": "Nallamuthu Gunasekaran",
        "period": "6 months ago",
        "review": "Recently had corporate health check up and the experience is really good. From entrance of hospital to consultant,they provided respect and decent service. Receptionist (Abinaya,Bhuvaneshvari and nurse Lavanya) doing polite and nice service. Hospital is very silent, neet  and clean. Took additional paid consultation for Senthinathan. Recommended for corporate health checkup."
    },
    {
        "reviewer_name": "Bhuvana Krishnamurthy",
        "period": "6 months ago",
        "review": "Very good experience for my mother’s surgery with Dr Nandhini.The doctor is very efficient and approachable for any queries before and after.Her staff (Rashika) is also very responsive and helpful."
    },
    {
        "reviewer_name": "gsrvkd",
        "period": "a month ago",
        "review": "Dr. senthil Nathan sir is realy gem of the hospital.very very patient  and soft spokenhospital  staff also very good and kind attention"
    },
    {
        "reviewer_name": "vishnu shankar",
        "period": "4 months ago",
        "review": "Senthilnathan Doctor is very kind and listen to patient problems.Advises to follow lifestyle modification along with medicinekind staff and clean atmosphere."
    },
    {
        "reviewer_name": "S.R. RAVI",
        "period": "5 months ago",
        "review": "Treatment for daughter 's urinary tract infection was good.Dr.Srivatsan and Dr. Srinivasan and other Doctors care is very much appreciated. Thanks to Gem Hospital."
    },
    {
        "reviewer_name": "saranyad s",
        "period": "5 months ago",
        "review": "Gem hospital perungudi is having a wonderful and skilled doctors I went a surgery of liver hepatectomy which is a major surgery I got recovered within a week it's an amazing treatment thank you so much Dr.Mr.Senthilnathan sir and Dr.Mr.Srivatsan sir.Their staffs and nurse's also doing good and handling the patients with care"
    },
    {
        "reviewer_name": "Sharik Hasan",
        "period": "9 months ago",
        "review": "My heartfelt thanks to Dr.Delphin Supriya. My Hospital stay was very comfortable and very responsive . The nursing care was excellent.The ward staff were very pleasant. Everything is was very amicable. I felt like staying back for few more days. And specially I need to thanks for R.Rashika PRO she was very good and responsive. She was awesome in her coordination. I raise hand for her. I called her on night time also but she response properly and very pleasant manner. Wonderful experience on my stay. Thank you gem hospital."
    },
    {
        "reviewer_name": "Parthiban s",
        "period": "2 months ago",
        "review": "Admitted my wife for treatment with Dr. Nandini gynaecologist, the treatment ,consultation and rooms were good."
    },
    {
        "reviewer_name": "Snega Madhan",
        "period": "4 months ago",
        "review": "Got admitted for laparoscopic herina surgery and the coordination was good. Dr.Senthilnathan explanation about the was commendable.Gem is really Gem"
    },
    {
        "reviewer_name": "Vijayan R",
        "period": "7 months ago",
        "review": "My wife had a surgery in Gem hospital . The service they provided was too Good. The level of care and treatment provided surpassed our expectations. The equipment, along with the highly skilled staff, ensured that we received the best possible care. The team's approach towards us was truly remarkable, as  Dr.Pinak Das Gupta & Dr.Cibi & Dr. Praveen’s gave good treatment. I would like to express our heartfelt gratitude to the entire team at Gem Hospital for their exceptional service."
    },
    {
        "reviewer_name": "Raguram Mech",
        "period": "6 months ago",
        "review": "Best caring... Friendly Environment... Cleanliness... Outstanding Hospitality... Explain what kind of treatment is that and why they are doing it and what could be the outcome...Many Thanks 🙏 to the Doctors and Nurses... Thanks for the supporting staffs and Insurance Team....🤗🤗🤗🤗"
    },
    {
        "reviewer_name": "K. Pooja",
        "period": "3 months ago",
        "review": "Dr.P.senthilnathan sri Good service and good care of  me  thank you sri for all your support and wishes me to get back to normal stageSandhya : very good service and good care mam thank you so much mam for all your support and help"
    },
    {
        "reviewer_name": "Siva samy",
        "period": "a year ago",
        "review": "I can't say enough good things about Gem Hospital Perungudi Chennai. From the moment I stepped through their doors, I was greeted with warmth and compassion. The treatment I received was top-notch, thanks to their well-advanced equipment and dedicated staff. They provided exceptional support throughout my stay, ensuring that I felt cared for and loved. The billing and insurance process was a breeze, with clear explanations and guidance every step of the way. Gem Hospital Perungudi Chennai truly exceeded my expectations with their knowledge, experience, and approach to patient care. I am completely satisfied with my experience there!"
    },
    {
        "reviewer_name": "Dhana Sundar",
        "period": "a month ago",
        "review": "It was a smooth experience throughout the health checkup, thanks for the support Bharathi and Sripriya Sisters"
    },
    {
        "reviewer_name": "VINOTH",
        "period": "a month ago",
        "review": "Came for medical checkup, quick tests and good hsopitality.Attendants bhuvaneshwari and deepa were kind and helpful!"
    },
    {
        "reviewer_name": "Rishi Kumar",
        "period": "4 weeks ago",
        "review": "Good Hospitality and co ordination from deepa bhuvaneshwari best report review and consultation from the doctor tests are first class"
    },
    {
        "reviewer_name": "grace roshini",
        "period": "5 months ago",
        "review": "My mother recently underwent uterus removal surgery under the supervision of Dr.Delphin.Dr.Delphin's diagnosis, support and patience smoothened the entire process."
    },
    {
        "reviewer_name": "Spbcontractor 2015",
        "period": "3 months ago",
        "review": "Myself Bhuvaneswari I was had surgery of fissure done by dr Pinak it was good and comfortable and the way of treating patient is so good"
    },
    {
        "reviewer_name": "Ragul .V.B",
        "period": "a week ago",
        "review": "Staffs were gentle and guided nicely. Overall experience was so good."
    },
    {
        "reviewer_name": "Govardhan OR",
        "period": "7 months ago",
        "review": "I visited Gems Hospital in Perungudi tonite 2.30 am because I had severe stomach pain and diarrhea. I was happy to see that the emergency duty doctor, Ashvini, and the entire night staff were polite and took good care of me. I was shivering badly and had a fever, and they gave me three blankets parellely treatment was going onn, my shivering did not stop. I appreciate that they turned off the air conditioner in the emergency room at midnight during the summer because I was the only patient there and they couldn't see me suffer. About eight to nine staff members stayed in the emergency room for two hours until I was discharged, and they turned off the AC for me. This shows very good customer Approach. Other hospitals would not do this, giving technical reasons for not turning off centralized AC.They also treated me well. Few hospitals will insists for admission for every night treatment patients. These guys sent me off once I was Allright..Their hospital bills and fees are very reasonable for middle-class and upper-middle-class people. Kudos to the entire night shift emergency team. Thank you very much! 👃👃👃"
    },
    {
        "reviewer_name": "sinduja s",
        "period": "3 months ago",
        "review": "I was admited here for hernia and the hospitalization  was really good. My treatment and painless surgery notable here. Thanks gem"
    },
    {
        "reviewer_name": "Suriya Prabakaran",
        "period": "8 months ago",
        "review": "I am delighted to share my positive experience of Gem Hospital. After visiting the Hernia Campaign, my brother was admitted to the hospital for further treatment. From the outset, Dr. Srinivasan, a gastroenterologist, was kind, polite, transparent and forthcoming about the surgery. The staff were highly experienced and provided excellent care. They were well-trained and excellent in service. They took great care during surgery and follow-up after surgery.I would like to extend my gratitude to the doctors at GEM Hospital, particularly Dr. Senthil Nathan, Dr. Srivatsan Gurumurthy, Dr. Srinivasan Mani, and PRO Monisha. I am pleased to report that my brother's condition has improved significantly. The hospital is well-maintained and meets all hygiene standards. From the moment we arrived until the moment we left, we were consistently satisfied with the care provided. I am certain that our decision to select this hospital was the right one.I would like to extend my congratulations to the staff and management of GEM Hospital for their dedication and commitment to providing excellent care."
    },
    {
        "reviewer_name": "GUNASEKARAN VEDACHALAM",
        "period": "3 weeks ago",
        "review": "Dr.Ajay and all other staff members are treated well ..Treatment and hospitality are very good."
    },
    {
        "reviewer_name": "Karthika Janani",
        "period": "9 months ago",
        "review": "My heartfelt thanks to Dr.senthilnathan and team. I kept postponing my surgery for some reason but my Hospital stay was very comfortable and I felt like I was cradled again at 67yrs . The nursing care was excellent.The ward staff were very pleasant.The diet was apt they were no hard and fast rules so the normal rigidity of a corporate hospital wasn't there ,made everything amicable. I felt like staying back for few more days. Prathiba was awesome in her coordination."
    },
    {
        "reviewer_name": "Sundhari Sundhari",
        "period": "8 months ago",
        "review": "I have admitted in gem hospital. It was very good experiences. Expertise service, approachable and friendly environment. I will be grateful to the Dr.Delphin supriya. She gave a nice treatment for me. I will be thankful to her. Thank you so much gem hospital for wonderful experience. And I need to say thanks to Rashika PRO for wonderful guidance. She guides good in my whole journey in gem hospital. Thank you so much for the whole team."
    },
    {
        "reviewer_name": "keerthinathan s",
        "period": "7 months ago",
        "review": "Such a caring Hospital for any of your medical needs. GEM took extraordinary efforts to save my mother and she is good now. For past Year, we have recommended many people regarding gastro and hernia.. all are doing good now. Thanks Senthilnathan Sir, Babu Sir and Gem team for great support"
    },
    {
        "reviewer_name": "Balaji Parthasarathy",
        "period": "8 months ago",
        "review": "My father aged 86 years had a cholesystectomy surgery last week and we really thank the expertise of the surgeons as his issue is resolved and he is recovering good. Also we thank all the DMO, staffs and nurses for giving an excellent care and support."
    },
    {
        "reviewer_name": "Jayachandran M",
        "period": "4 months ago",
        "review": "Hospital ambience was felt like home Dr.Senthil Nathan and his team was super supportive during our tough times .Thank you sir for remarkable service."
    },
    {
        "reviewer_name": "Easter Rani",
        "period": "10 months ago",
        "review": "I consulted Dr. Ajay Pai for treatment of fissure and underwent a surgery yesterday. Excellent care was taken by Dr. Ajay and his team, nursing staffs. The hospital has excellent facilities, neat and clean room and all the services are offered at a reasonable price. Overall a very good experience, thanks to all the doctors, nurses and hospital staffs for the care taken."
    },
    {
        "reviewer_name": "Balakrishnan Muralidharan",
        "period": "10 months ago",
        "review": "I am so grateful to the hospital and insurance team at Gem Hospital. They made my stay comfortable and stress-free. I visited them for ERCP & cholecystectomy for my wife and I was nervous about it. But the doctors and nurses were very reassuring and caring. They did an excellent job and she recovered quickly.The insurance team was also fantastic. They were fast, friendly, and reliable. They covered all the costs and gave me peace of mind. I am very satisfied with the results and I would highly recommend to anyone who needs this kind of service."
    },
    {
        "reviewer_name": "Vivek V",
        "period": "7 months ago",
        "review": "My mother recently underwent surgery in GEM hospital and I was really happy with Overall excellent service by the Doctors , physicians and Nurses. Thanks to Doctor Niranjan and Team for their excellent services. I would rate GEM hospital the best for Gastroenterology in Chennai."
    },
    {
        "reviewer_name": "manikandan manoharan",
        "period": "7 months ago",
        "review": "Dr. Delphin supriya are very friendly, and explained in detail patiently about the surgery and treatment.The nursing care was excellent. I need to thanks for R.Rashika PRO she was very good and responsive."
    },
    {
        "reviewer_name": "Mari Selvam",
        "period": "4 months ago",
        "review": "This time we admitted our father in gem hospital perungudi very good service..... Very clean floor n special appreciation for Aniii staff nurse"
    },
    {
        "reviewer_name": "manasaa selvaraj",
        "period": "7 months ago",
        "review": "I went to GEM hospital via medibuddy for ultrasound. The service they provided was excellent. They have taken care patients with utmost care. In ultrasound, Monisha helped me a lot to get the scan done quickly.Since I went through insurance it took longer time than usual for registration. So it could be better if that was taken care next time."
    },
    {
        "reviewer_name": "S. Manju Sri",
        "period": "2 months ago",
        "review": "I have received an nice care with attentive staff and services overall it's a  good hospital with experienced doctors"
    },
    {
        "reviewer_name": "S Ravi",
        "period": "7 months ago",
        "review": "Good morning Gem. I'm Chitra.R,I wanted to take your andy time to express my love and gratitude towards gem hospital for the exceptional care and the way in treating me. Your great service saved my life, our entire family will be forever grateful towards hospital and I will refer more patients. Thank you so much to the Dr.Delphin Supriya who saved me and Special thanks to Rashika PRO and staff nurses, for everything you did for me. The house keeping service was good. Thank you so much gem hospital"
    },
    {
        "reviewer_name": "Saravanan Maruthappa",
        "period": "a month ago",
        "review": "Came for a medical check up ..good service ..would like to appreciate Bharathy & Bhuvaneshwari especially .they are very kind and hardworking"
    },
    {
        "reviewer_name": "Raja V",
        "period": "6 months ago",
        "review": "When it comes to any form of troubles Stomach, I would say GEM Hospitals are the very best. I’ve been consulting Dr. Vinoth Kumar since 2019, he is the best I’ve known. Special mention to the team of nurses at Gastroenterology I’m able to consult Vinoth Sir over phone as well. If you’ve any problems with your stomach don’t think about anyone just consult Dr. Vinoth Kumar, I assure you all that you would definitely get well."
    },
    {
        "reviewer_name": "Karthick Sambandam",
        "period": "3 months ago",
        "review": "Myself and wife went for physicals today.. It was good and staff are very helpful particularly Sister Nandhini, she was with us for the whole time and helped."
    },
    {
        "reviewer_name": "Sambasivam V",
        "period": "9 months ago",
        "review": "Last week my wife was in GEM Hospital for surgical treatment for removal of Kidney Stone and Para Thyroid gland. As she has underwent the pain of stone surgery before, she was scared to go through that ordeal again. But after meeting  Dr. Senthil Nathan, Dr. Jayanth and Dr. Yuvaraj, she got the comfort after the explanations and promises by all the three and and agreed for the surgical procedure and as promised they combined both the surgeries and completed the same in an excellent way which my wife was so happy after the procedure. While recuperating she is comparing the pain she underwent earlier and how she is feeling now. Thanks for the team of Doctors - including the Anaesthetist who supported the surgery and other doctors who were involved.It was a nice experience for us in the hospital with excellent service by the Nurses and the support staff who were so kind and supportive and ready to extend any help at any time. The food provided was good and the maintenance and cleanliness was excellent .I want to mention very specifically that none of the support staff or security were expecting any kind of tips which was surprising to us as we had faced the menace in other hospitals and were so kind too.Finally i want to mention about the support received from the Finance team (Saranya) who was very helpful with handling the complicated twin surgery procedure claim with my insurance.I would certainly recommend GEM hospital to my friends and family for getting a better treatment."
    },
    {
        "reviewer_name": "G RAVISANKAR",
        "period": "8 months ago",
        "review": "Good morning. My name is Jayalakshmi I consulted Dr.Nandhini mam for treatment and for surgery. Excellent care was given by Dr.Nandhini Mam, Dr.Delphin Supriya and his team, nursing staffs. The hospital has excellent facilities, pleasant room and all the services are offered at a reasonable and worthable price. Overall a very good experience, thanks to all the doctors, nurses and hospital staffs for the care given to me. Especially I need to say thanks to Rashika PRO. She guides me a lot. Best guidance from her. Thank you so much gem."
    },
    {
        "reviewer_name": "Subramanian Jawaharlal",
        "period": "9 months ago",
        "review": "Last week (April 24)I admitted in GEM Hospital Perungudi for my stomac pain.Doctor Mr. P. Senthilnathan and his team was given me the𝗘𝘅𝗰𝗲𝗹𝗹𝗲𝗻𝘁 𝗰𝗮𝗿𝗲' and treatment.𝗛𝗲𝗿𝗲 𝘀𝗶𝗻𝗰𝗲𝗿𝗲𝗹𝘆 𝗶 𝘁𝗵𝗮𝗻𝗸,all doctor's, Nursing senior & ward staff's, and PRO team.𝗗𝗲𝗳𝗶𝗻𝗶𝘁𝗲𝗹𝘆 𝗶 𝗿𝗲𝗳𝗲𝗿, GEM hospital to my colleagues,relatives and Friends.𝗢𝘂𝘁𝘀𝘁𝗮𝗻𝗱𝗶𝗻𝗴 𝗣𝗲𝗿𝗳𝗼𝗿𝗺𝗮𝗻𝗰𝗲 by all sections."
    },
    {
        "reviewer_name": "Sangeetha Anbarasu",
        "period": "8 months ago",
        "review": "Service and experience of the hosputal is good. Dr Nandhini was kind, polite and explained every procedure in detail and gave confidence at every step. Nurse were very responsive and took good care of us."
    },
    {
        "reviewer_name": "Gunaseelan Rajasekar",
        "period": "5 months ago",
        "review": "Its good to review health under Gem.Accuracy was goodConsultant was superbGood facility and staff.Overall Good.Recommended 100%Tuesday to thursday its better to visit to save time 😊"
    },
    {
        "reviewer_name": "Kaavya Priya",
        "period": "9 months ago",
        "review": "Doctors were very polite and listening. Ongoing a treatment, hope to get well soon. They also suggested me to see dietitian. Dietitian was too friendly, energetic and kind. Consulting with her was therapeutic. And gave me some good advice on diet."
    },
    {
        "reviewer_name": "Bodhi Dharma",
        "period": "6 months ago",
        "review": "Excellent Treatment and service from gem hospital. Staffs and patient care team guidance is too good. Now I recovered well. Special thanks to Dr.Asokan and Dr.srinivasan mani ."
    },
    {
        "reviewer_name": "Dr. K.S. Saravana Krushna Raja",
        "period": "4 months ago",
        "review": "Very good hospitality with all facilities available in one roof."
    },
    {
        "reviewer_name": "Sabreena Kohli",
        "period": "8 months ago",
        "review": "I recently received treatment at GEM HOSPITAL and I cannot express enough gratitude for the exceptional care and compassion provided by the staff.From the moment I walked through the doors, I was greeted with warmth and professionalism. The receptionists were efficient and friendly.The medical staff, including doctors, nurses, and technicians, were truly outstanding. They demonstrated not only expertise in their respective fields but also genuine concern for my well-being.The facilities at Hospital are state-of-the-art, equipped with the latest technology to deliver cutting-edge medical treatments. Yet, it was the human touch that stood out the most. Every member of the staff, from the cleaning crew to the top-level administrators, contributed to creating an atmosphere of healing and compassion.My Big thanks to both the Doctors,                 Dr. Senthilnathan and Dr. Delphin Supriya for their expertise due to which my surgery was successfull with no complications.In conclusion, will highly recommend GEM HOSPITAL  Whether you require routine care or specialized treatment, you can trust that you will be in capable hands. Thank you to the entire team for making my experience a positive one."
    },
    {
        "reviewer_name": "G BARATH VASANTH",
        "period": "a week ago",
        "review": "Dr pinak sir consultation very satisfied and sandiya madam clearly explain everything."
    },
    {
        "reviewer_name": "Shaowkath Ali",
        "period": "7 months ago",
        "review": "Good morning gem. I Came to the hospital for the surgery and consultation under Dr.Pinak and Dr.Nandhini mam. I have got the best medical support from the doctors and from the whole team. And I have to thank nurses, management and Rashika PRO for wonderful guidance. Thank you so much gem hospital."
    },
    {
        "reviewer_name": "Vijayalekshmi Veerabahu",
        "period": "7 months ago",
        "review": "My mom got operated by Dr. Senthil Nathan for Umbilical Hernia surgery. He gave clear explanations and attentive support pre and post-operation. The entire team, including Ms. Pratibha, coordinated seamlessly, providing us with exceptional comfort. We highly recommend Dr. Senthil Nathan and his team for their expertise and compassionate care."
    },
    {
        "reviewer_name": "Tharika A R",
        "period": "6 months ago",
        "review": "Best place to opt for laproscopic procedure. Doctor Ramya sridharan and dr Delphin took care of all the things in professional and smooth manner. I would give 5* for the hospital team for taking care of me so well❤️🍁 thank you so much! Thanks much again🤗"
    },
    {
        "reviewer_name": "User yemmy",
        "period": "8 months ago",
        "review": "Excellent and wonderful services in gem hospital. Dr. Delphin supriya are very friendly, and explained in detail patiently about the surgery and treatment.The Rashika PRO guided me in all time about the hospital and Surgery. The Nursing staff are also gave me a good services. We felt very happy.We are lucky to choose GEM HOSPITAL.We are grateful to the GEM hospital management.Many many thanks to to the management and for Dr.Delphin and for Rashika PRO and nurse."
    },
    {
        "reviewer_name": "ARUN KUMAR",
        "period": "6 months ago",
        "review": "Admitted and done procedure for my dadHospital is located on prime position andBoth procedure post surgical care was good..Rooms was clean and neatOverall completely satisfied"
    },
    {
        "reviewer_name": "Rhekha Logaperumal",
        "period": "9 months ago",
        "review": "Admitted our mom here for Gall bladder removal operation and beyond our expectations, everything went so well and on time and the cost of the operation too was low compared to many other famous hospitals and the way they carried the operation and treated the patient and the room alloted including hygienic food and clean atmosphere inspired us a lot. More thanks to Dr.Pinak Dasgupta and all the sisters who helped us and completed everything smoothly. I would strongly recommend Gem hospital for its quality ."
    },
    {
        "reviewer_name": "ankit seth",
        "period": "10 months ago",
        "review": "Very experienced team of doctors to care free sugeries. Special thanks to Dr. Shrivatsan Gurumurthi and her PRO for explaining everything Very calmly and treatement done very nicely without any problem.Very nice hospital, with all the advanced procedures available for surgeries. Very well trained and very well behaved team to support the patient and the family. Troublefree experience from insurance department as well and their support after procedures is well appreciated."
    },
    {
        "reviewer_name": "A Pranav",
        "period": "a month ago",
        "review": "Dr senthilnathan sir treatment plan very satisfied And pro sandiya sis very helpful. Thank you"
    },
    {
        "reviewer_name": "Sivajothi",
        "period": "7 months ago",
        "review": "I have undergone a surgery yesterday. The service of doctors and staff nurse is too good. PRO Meenakshi sis guided very well and patiently. I recommended this hospital. Special thanks to Dr. Srinivasan sir and team."
    },
    {
        "reviewer_name": "Vignesh m",
        "period": "8 months ago",
        "review": "I have done incision and drainage procedure in gem hospital. Hospital is very clean and hygiene. Srivasan Mani sir explained procedure and done it. All nurses and staffs friendly. Reasonable surgery fee and accommodation fee. Overall am suggesting gem hospital for all kind of medical illness."
    },
    {
        "reviewer_name": "Joice Monna",
        "period": "4 months ago",
        "review": "Dr.pinak dasgupta was a very good doctor.The hospital staffs were approachable and understanding.The hospital food and cleanliness was very good."
    },
    {
        "reviewer_name": "Mr Janardhana Reddy",
        "period": "10 months ago",
        "review": "Excellent and courteous services. Dr Dasgupta and Dr praveena are very friendly, and explained in deatil patiently about the disease and surgery.My son got surgerysuccessfully .The PRO Miss.Kousalya assisted in all aspects to join in the hospital and Surgery.   The Nursing staff are also renderd good servives . ForEvery six hours all the doctors and staff took care. We felft very happy.We are lucky to choose GEM HOSPITAL.We are grateful to the GEM hospital management.Many many thanks to to the maagement."
    },
    {
        "reviewer_name": "Ananth Sivaraman",
        "period": "7 months ago",
        "review": "Very good experience. Doctors are very supportive and have been communicating Very well during the entire course of treatment. Equally good infrastructure and administration. Appreciate the good work."
    },
    {
        "reviewer_name": "kannan aj",
        "period": "8 months ago",
        "review": "Came to hospital for fistula issues and surgery consultation under Dr.Asokan, Dr.Pinak, Dr.Niranjan and we got the best medical support from the doctors and team. The support staff team and Kausalya did a good work at the management level."
    },
    {
        "reviewer_name": "KARTHICK P",
        "period": "3 weeks ago",
        "review": "Staff were polite and friendly. Doctor consultation was good."
    },
    {
        "reviewer_name": "Parthiban N",
        "period": "5 months ago",
        "review": "Dr. Umashankar and team excellent.. All latest instruments and detailed explanation and fastrack diagnosis and treatment... 100% I recommend GEM hospital"
    },
    {
        "reviewer_name": "Krithika Prabakaran",
        "period": "8 months ago",
        "review": "I'm Krithika,I wanted to take a moment to express my deepest gratitude for your exceptional care and expertise in treating my mother during her battle with Acute pancreatitis. Your dedication, skill, and compassion undoubtedly saved her life, and for that, our entire family will be forever grateful. Thank you so much to all the doctors who saved my Amma and Special thanks to Senthilnathan sir and Srivatsan sir for everything you did for us✨️ GEM hospital has proved that \"\"வயிறுநாளே ஜெம் தான்\"\"💎"
    },
    {
        "reviewer_name": "Godfrey Selvaraj",
        "period": "8 months ago",
        "review": "Visited Gem Hospital for the Annual Master Health Checkup.Had a great experience right from the Registration till Receipt of Reports including consultation.The process was very Professional and Efficient and the technicians did a great job. To mention a few,Miss Abinaya in the Registration desk-She handled the registration process very professionally with a graceful touch.Miss Deepa ,Staff who was assigned ,managed the sequence effectively with efficiency so that the whole process was completed in the shortest possible time.Not many places where you can leave this fast.Kudos to the entire team.Request to sustain."
    },
    {
        "reviewer_name": "Manikandan B",
        "period": "6 months ago",
        "review": "My name Manikandan my wife Rajeswari kidney transplant surgery finish successfully on (24.6.24) Gem hospital perungudi thank you for Everything  Dr.balamukunthan (nephrologist) very carring and good person thank you sirDialysis team Ram,Reshma,Elakiya,susmaNephrologist teamAngel sister,naveena sisterSo carring and responsible persons thank you for EverythingSpecial thanks to Dr.senthilnathan sir good hospital neat and clean all staffs so carring and responsible thank you all"
    },
    {
        "reviewer_name": "Soulina",
        "period": "3 months ago",
        "review": "Dr pinak sir very well treatment thank you sir. Staffs also good responsibility thanks for all support"
    },
    {
        "reviewer_name": "Sridhar V",
        "period": "9 months ago",
        "review": "I was supervised under Dr srinivasan mani for my health issue. He is very kind and have good listening ears to take all thr health issues of the patience.. He address the issue with great care and compassion. I appreciate his work and wish him all the best. He is a great asset to GEM hospital."
    },
    {
        "reviewer_name": "Asha Krishnamurthy R",
        "period": "4 months ago",
        "review": "In may 2023, I was admitted in GEM Hospital for severe Jaundice and Liver disease. Under the care of a team of precious doctors got cured.    But, got into severe depression and lost the will to live.When I met Dr. Mrs, Mridula V Abirami, Psychiatrist. I had no hope that my depression would go, but after 3 meetings with her everything changed. I got my mental peace back.  The way she talks opens eyes. She creates a sister like bond like an angel. I recommend everyone who has psychic problems to see her once. Fees is small, but Mrs Mridula is too great in her profession. I still meet her once in two months out of gratefulness and immense affection. All the best to the lucky ones who gets to meet her.        Rajesh lingam, Film Director"
    },
    {
        "reviewer_name": "Sekar Govindaraj",
        "period": "a week ago",
        "review": "Doctor treatment to good and sandhiya madam very helpful and friendly"
    },
    {
        "reviewer_name": "Kunal Kashyap",
        "period": "10 months ago",
        "review": "Very happy with the service and facilities provided in this hospital. Special thanks to Dr.Pinak and Ms Kaushailya. She is very polite and helpful.Dr  Pinak is very friendly and well experienced doctor. Special thanks to their insurance department. They helped to process the insurance process and at the time of discharge everything got settled very smoothly.  Thank you so much."
    },
    {
        "reviewer_name": "vicky crs",
        "period": "7 months ago",
        "review": "Great Experience. Good and Nice infrastructure. Doctors are highly experienced and the nursing staff  were super supportive. Thanks to Bhuvana Staff for the nice Gesture & Hospitality."
    },
    {
        "reviewer_name": "pramodh kiran varma",
        "period": "a month ago",
        "review": "Staff Bharathi and Bhuvaneshwari were very helpful in assisting us for MHC!"
    },
    {
        "reviewer_name": "Salma B",
        "period": "10 months ago",
        "review": "Administrative staff , coordinating staff of doctors and counter nurses are to be improved .They do not resolve issues of one customer and jump to another.They sleep on documents and keep patients waiting ( morning discharge patient can only go home at night )Secretaries n coordinating staff of surgeons can give one a very hard time ( personal experience )Note: GEM cannot be a gem of a hospital if it cannot improve on the above"
    },
    {
        "reviewer_name": "RamaKrishnan Jayaraman",
        "period": "7 months ago",
        "review": "One of the best gastro hospital in south India and 6 ⭐ for all services provided by co ordination team, insurance team and surgical team thank you for all the help especially Dr senthil, Dr Sriram and all there team members. May Lord Krishna bless them all"
    },
    {
        "reviewer_name": "Ramanathan Ganapathy",
        "period": "5 months ago",
        "review": "I was patient od Dr.senthilnathan .I am extremely happy with the services rendered by the hospital doctors nursing staff and the entire team and other services also quiet satisfactory. Namasthe"
    },
    {
        "reviewer_name": "Rama Krishna",
        "period": "4 months ago",
        "review": "Dr.ajay pai. Very quality of care and caring very good .iam full statisfied. Good hospital chennai."
    },
    {
        "reviewer_name": "Prabhu Alexander",
        "period": "a month ago",
        "review": "Excellent service Dr. Srivinasamani sirFront office staffs especially jivapriya and bueneswawari."
    },
    {
        "reviewer_name": "priya janakiraman",
        "period": "8 months ago",
        "review": "Abhinaya's swift and compassionate assistance ensured your mother received excellent care at Gem Hospital, guiding you seamlessly through the process with clear communication and professionalism."
    },
    {
        "reviewer_name": "Makesh Kumar",
        "period": "10 months ago",
        "review": "GEM hospital Dr.Senthilnathan is extremely patient and great doctor explains the scenario and next steps clearly. Hospital staffs are friendly and helping nature. On the improvement side process can be improved a bit. Overall good and trustable hospital."
    },
    {
        "reviewer_name": "Subhadeep Saha",
        "period": "8 months ago",
        "review": "It was really a great experience...the doctors are experienced. The staffs are really courteous and helpful. A very clean and well  maintained place. Mrs.Piyu really helped us with every steps. Thanks for the wonderful support."
    },
    {
        "reviewer_name": "Elakkiya Madhiyazhagan",
        "period": "8 months ago",
        "review": "My Appa (C.Madhiyazhagan)had a surgery for hernia here.. Right from the consultation to surgery overall process was so meticulous.. Dr. R NIRANJAN(MS, MCh, DMAS, FMAS) Guide us so well throughout the treatment. Hospitality was top notch. Doctors , nurse and caretakers are so humble,kind and also loyal towards their duty. My Appa is also recovering well. We are so grateful for their wonderful hospitality and treatment...Thank you."
    },
    {
        "reviewer_name": "shajahan NAGA",
        "period": "8 months ago",
        "review": "We had a laproscopy surgery for my daughter, had a good experience from the staff and the doctors especially with thorough detailing about the laproscopy process from Dr.Palanivellu, Dr. Senthil nathan, Dr. Delphin and Dr.Harishmitha.Best hospital for laproscopy."
    },
    {
        "reviewer_name": "Arianayagam Chandran",
        "period": "8 months ago",
        "review": "My name is Vijaya. I have admitted under Dr. Delphin Supriya. She taking care me good. Very nice person.  The inpatient wards were really nice. I didn't have any complaints. It showed they really cared about making things better for everyone. And especially Rashika PRO take care good. She guides me alot and behaves very calm and good . Thank you so much GEM"
    },
    {
        "reviewer_name": "Mohanraj Mani",
        "period": "a year ago",
        "review": "I had a positive experience at this facility during my brother's surgery. Dr. Sreedhar's expertise and the dedicated staff created a comforting atmosphere. The outstanding service make this center highly recommended for excellent care.Thanks to all for the support."
    },
    {
        "reviewer_name": "Praba Karan",
        "period": "9 months ago",
        "review": "Good Sevices for umbilical Hernia. I wanted to extend my sincere thanks for the doctors( Doctor Pinak Dasgupta and his team) and nurses who supported my wife during operation and Post surgeryAnd wanted to give my special thanks to Miss Kaushalya working as a PRO she assisted well in receiving Patients and explaining in details well patiently and supported well."
    },
    {
        "reviewer_name": "Karpagavalli Rajagopalan",
        "period": "4 months ago",
        "review": "My mum is admitted here and the funniest part for car parking they charge which is in their own building and when enquired they say it is process for the past 5months...doesn't make any sense"
    },
    {
        "reviewer_name": "SUBRAMANIAN RAMASAMY",
        "period": "2 months ago",
        "review": "Dr pinak treatment is very good. Staffs all good Co-ordination thanks you"
    },
    {
        "reviewer_name": "Nickson Antony",
        "period": "8 months ago",
        "review": "Doctors here have outstanding expertise and are able to provide accurate diagnosis.               Dr. Srivatsan gave good hope and was very supportive throughout the process. All the staffs coordinated very well."
    },
    {
        "reviewer_name": "Babu Sathya",
        "period": "11 months ago",
        "review": "We consulted Dr. Pinak Dasgupta Sir for Fistula issue and underwent a surgery yesterday. We are happy that have chosen the Gem Hospital as the treatment and care is really exceptional. We thank the management for rendering great support to the patient. Special thanks to Dr. Pinak Dasgupta, Dr. Senthilnathan and Dr. Praveena."
    },
    {
        "reviewer_name": "Muvva Dharanija",
        "period": "3 months ago",
        "review": "Good services. Nandhini sister took good care of us from starting to till end. Thank you."
    },
    {
        "reviewer_name": "PONNI VALAVAN",
        "period": "10 months ago",
        "review": "My mother had gallbladder stone and underwent laparoscopic surgery performed by Dr. Senthinathan. Everything went well; the doctor's skill, the hospital's cleanliness, and the supportive staff made the entire hospitalization experience very positive."
    },
    {
        "reviewer_name": "Murugan Pampul",
        "period": "10 months ago",
        "review": "Excellent consultation and treatment by the doctor Pinak Dasgupta. His treatment clered my piles pain in 3 days and suggested medicine are very helpful. Doctor is vey polite with patients and he allow us to explain all our issues.Thank you so much doctor pinak Dasgupta Sir and Gem hospital."
    },
    {
        "reviewer_name": "Manjula K",
        "period": "5 months ago",
        "review": "Dr srinivasan mani is a good doctor and remember all my gastrointestinal issues and gives proper guidance and support."
    },
    {
        "reviewer_name": "Chandrasekaran Ramanathan",
        "period": "a year ago",
        "review": "My experience in Gem hospital was really wonderful from day 1 when I entered for Gall bladder surgery.Discussing the details of the problem and the further course of action to be taken with Dr Palanivel Senthilnathan itself was a pleasant experience and he explained all the details very patiently and upto our satisfaction. His smiling. face was an inspiration and encourages me to proceed with the surgery. Ofcourse, the surgery was done neatly and I am recovering fast. Throughout my stay in the hospital, the services of the staff while taking the necessary blood tests and other investigative tests were simply best. The visits by doctors post surgery explaining all my queries, the utmost care taken by all the nursing staff and other supporting staff was really great.The administrative staff including the insurance department were very helpful. The pleasant surprise was the visit of the Director, Mrs.Senthilnathan enquiring about the facilities and wishing for speedy recovery. A special mention to be made about Miss.Prathiba who has guided me right from the beginning till I was discharged for her valuable services.All the doctor's and other staff were very kind and were responsible and responsive.The ambience of the hospital and the cleanliness of the rooms and surroundings were excellent.In short, the Gem hospital is really a gem of a hospital."
    },
    {
        "reviewer_name": "Vivekanandan Sathirum Srinivasan",
        "period": "a year ago",
        "review": "Very caring and excellent service. Was admitted for angiogram in cardiology department. Right from the start to end they took good care of me during the process. Especially Shanthi PRO in cardiology department helped us throughout the process and made it comfortable."
    },
    {
        "reviewer_name": "Meenakshi sundaram N",
        "period": "7 months ago",
        "review": "Excellent Team of Doctors and Staff. Good care for the patient. Special mention and thanks to Dr Vanmathi, Dr Srivatsan, Dr Sriram and their team of Doctors and Staff."
    },
    {
        "reviewer_name": "Shamsuddin",
        "period": "4 months ago",
        "review": "Dr pinak sir treatment is good thanks. Staffs all so... Good service."
    },
    {
        "reviewer_name": "sathiah rajendran",
        "period": "7 months ago",
        "review": "I have really no idea about umbilical hernia Dr.Senthil Nathan gave us clear picture about surgical procedure and made us comfortable before surgery and post as wellHe is very humble and very professional also the entire team nurses and support staff each and every one gave us the comfortable surgery and we didn’t feel like hospital it was like star hotelMy overall experience was good thanks to the entire team for their support and hospitality"
    },
    {
        "reviewer_name": "Rathinavel Umachandran",
        "period": "7 months ago",
        "review": "Thankyou to DR Srinivasan mani sir and his team for their excellent care and also dr Babu sir and Team and best supported staff insurance team also.Their hospitality was really appreciated. All staff are very kind and responsive performaing thelr best work.Thank  you so much"
    },
    {
        "reviewer_name": "A.VINMATHY",
        "period": "a year ago",
        "review": "Starting with, i thank dr.Rajkumar sir for his ailment.The atmosphere around the hospital is relaxingWhich is much needed during our tough times... The nurses, non attending staffs, receptionist, physician were so kind and i will definitely thank them for their selfless servie they provide.... I would also thank ms. Priya and ms. Padma (receptionists) for guiding us during that panic situation and overcome the same.. The food offered for the patients and the attenders was simple but  hygiene was maintained... On the whole i would like to add up that they provide us treatment without hesitation and those calm words will definitely heal us....Thanks to god and gem hospitals"
    },
    {
        "reviewer_name": "Kathija Thameem ansari",
        "period": "6 months ago",
        "review": "They treat patients very well and do treatment with advanced technology, receptionist everyone doing well with the smiley face, especially abinaya mam👍"
    },
    {
        "reviewer_name": "Akash S",
        "period": "6 months ago",
        "review": "Excelect care and speedly recovered.Dr.Niranjan was taking care of very well and rooms arrangement was very good and Food was hygine and good with correct timing"
    },
    {
        "reviewer_name": "Rajeev Singh",
        "period": "a year ago",
        "review": "Very nice. Dr Pinak Das Gupta is a very good doctor and I am satisfied with the treatment accorded to me. I rate him very high and he is an asset to Gem Hospitals. His team is excellent and caring. I wish all of them the best ."
    },
    {
        "reviewer_name": "Mary Prabakar",
        "period": "9 months ago",
        "review": "My daughter undergone laparoscopic surgery for appendicitis by Dr. Mr. Srivatsan gurumurthy...my daughter discharged on the next day. The Dr and the staffs extended their fullest care and support ..."
    },
    {
        "reviewer_name": "Arthi Mathivanan",
        "period": "7 months ago",
        "review": "Such a sweet set of team members who welcome you with warm smile .Polite friendly swift .Abhinaya and team make you feel so much at ease.kudos and all the best to the complete team"
    },
    {
        "reviewer_name": "Alex Sander",
        "period": "7 months ago",
        "review": "Today I visited the hospital it was so neat and clean and the staff members were very friendly mainly in the front office and the registration process was so quick and the inten girl guided me well and also the treatment was good nice to visit this hospital"
    },
    {
        "reviewer_name": "Nallasivam RS",
        "period": "a year ago",
        "review": "We visited Gem Hospital, Perungudi by getting appointment with Dr. P. Senthilnathan through Ms.Prathipa personal secretary to Dr. P. Senthilnathan for my sister's hernia surgery. Ms.Prathipa had taken keen interest and got appointment with Dr. Senthilnathan immediately. She guided us in each and every procedure to the surgery enthusiastically. She appears calm and quiet but efficient. She diserves higher position to discharge her duties and responsibilities with high degree of confidence.Dr. Senthilnathan reviewed my sister's health report and responded positively with pleasant smile. He is empathetic and explained the surgery procedure in simple and human approach. Dr.Senthilnathan had done the surgery and briefed the details in nutshell which gave us great pleasure and enthusiasm. He visited my sister in the room daily and patiently reviewed her health status and had taken great care and attention towards her health.We felt smooth and calm atmosphere in the hospital. Treatment is excellent. Canteen food is homely.Facility and infrastructure of the hospital is in high standard.The doctors and staff had taken treatment seamlessly . Fee is normal and affordable. The hospital maintenance is neat and tidy.On the whole you can visit and trust Gem hospital for your better health care and well being ."
    },
    {
        "reviewer_name": "Megha S",
        "period": "a year ago",
        "review": "My uncle was admitted in this hospital under the supervision of Dr. Rajasekar. He behaved arrogantly and did not have any humane values. He acted very rudely and was only blowing his own trumpet. He is not fit to be considered as a doctor.  Kind request is to throw him. Worst experience ever and I DO NOT RECOMMEND!"
    },
    {
        "reviewer_name": "Kaliyan Pillai",
        "period": "11 months ago",
        "review": "Dr. Ajai Pai was so kind and expert in surgical gastroentrology. He patiently listened to my feedback. I was fully recovered now and perfectly alright after gullbladder removal."
    },
    {
        "reviewer_name": "Yss Dubai",
        "period": "6 months ago",
        "review": "دكتور ممتاز متمكن في ازاله الشبك لديه خبره وافيه تشعرك بالاطمئنان و الراحه لاجراء العمله .. شكرا دكتور  Pinak"
    },
    {
        "reviewer_name": "Haja Najumudeen",
        "period": "10 months ago",
        "review": "Totally excellent team work!!!And very much satisfaction. …"
    },
    {
        "reviewer_name": "B.S.Balakumar Balakumar",
        "period": "4 months ago",
        "review": "Dr. Punam Das Gupta. Fantastic surgeon"
    },
    {
        "reviewer_name": "Latha Eswar",
        "period": "3 months ago",
        "review": "Dr Senthilnadhan Sir & Dr sreeram treatment so good."
    },
    {
        "reviewer_name": "Akshayram V",
        "period": "9 months ago",
        "review": "Dr. VKG Rajasekar Chief CardiologistExcellent doctor"
    },
    {
        "reviewer_name": "Raajarajan Chandrasekaran",
        "period": "a year ago",
        "review": "excellent service by both Prathiba and Lavanya . Thanks for Chief Dr and Dr Sreeram and Dr Srinivasan.."
    },
    {
        "reviewer_name": "Devi Sundaram",
        "period": "4 months ago",
        "review": "Dr Pinak Das Gupta"
    },
    {
        "reviewer_name": "GOKUL",
        "period": "9 months ago",
        "review": "Dr. VKG Rajasekhar cardiology (Excellent Doctor)"
    },
    {
        "reviewer_name": "Moorthy L",
        "period": "8 months ago",
        "review": "Dr Srivatsan GurumoorthyExcellent service"
    },
    {
        "reviewer_name": "SUBHASHINI M",
        "period": "a year ago",
        "review": "Dr. PalanivelPatient M. Gnanasoundarigood care"
    },
    {
        "reviewer_name": "Arun Gym",
        "period": "11 months ago",
        "review": "Dr.shiram"
    },
    {
        "reviewer_name": "DINESH MA",
        "period": "3 years ago",
        "review": ""
    },
    {
        "reviewer_name": "kamal mutha",
        "period": "a year ago",
        "review": "Dr,Ajay pai and Dr Pinakdas gupta treatment done, excellent"
    },
    {
        "reviewer_name": "Sentha Thamarai",
        "period": "4 months ago",
        "review": "Dr senthilnathan"
    },
    {
        "reviewer_name": "sri vijay",
        "period": "a day ago",
        "review": "Bharathy parameswari they did well"
    },
    {
        "reviewer_name": "Uma Priya",
        "period": "a week ago",
        "review": ""
    },
    {
        "reviewer_name": "Sathish D",
        "period": "a week ago",
        "review": ""
    },
    {
        "reviewer_name": "R Reena josh",
        "period": "a week ago",
        "review": ""
    },
    {
        "reviewer_name": "Gopinath S",
        "period": "a week ago",
        "review": ""
    },
    {
        "reviewer_name": "Senthil velan",
        "period": "a week ago",
        "review": ""
    },
    {
        "reviewer_name": "nandhini devi",
        "period": "2 weeks ago",
        "review": ""
    },
    {
        "reviewer_name": "Balamurugan D",
        "period": "2 weeks ago",
        "review": ""
    },
    {
        "reviewer_name": "Rimpi Nag",
        "period": "3 weeks ago",
        "review": ""
    },
    {
        "reviewer_name": "Deep Shikha",
        "period": "3 weeks ago",
        "review": ""
    },
    {
        "reviewer_name": "Sunil",
        "period": "3 weeks ago",
        "review": ""
    },
    {
        "reviewer_name": "Prasad Ulagappan",
        "period": "3 weeks ago",
        "review": ""
    },
    {
        "reviewer_name": "Abi Nani",
        "period": "3 weeks ago",
        "review": ""
    },
    {
        "reviewer_name": "megha shrivastava",
        "period": "a month ago",
        "review": ""
    },
    {
        "reviewer_name": "Suja Samuel",
        "period": "a month ago",
        "review": ""
    },
    {
        "reviewer_name": "Vishnu Vinu",
        "period": "a month ago",
        "review": ""
    },
    {
        "reviewer_name": "SHABEER S",
        "period": "2 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Raj Mithra",
        "period": "2 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Sk Abdul Gaffar",
        "period": "2 months ago",
        "review": ""
    },
    {
        "reviewer_name": "keerthana raj",
        "period": "2 months ago",
        "review": ""
    },
    {
        "reviewer_name": "mohamed rafisarkar",
        "period": "3 months ago",
        "review": ""
    },
    {
        "reviewer_name": "SWETHA",
        "period": "3 months ago",
        "review": ""
    },
    {
        "reviewer_name": "VIVITHA L.E",
        "period": "3 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Karthikeyan Kathirvelu",
        "period": "3 months ago",
        "review": ""
    },
    {
        "reviewer_name": "poovarasan K",
        "period": "3 months ago",
        "review": ""
    },
    {
        "reviewer_name": "shruthi rodrigo",
        "period": "3 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Aravindan N",
        "period": "3 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Ram Kumar",
        "period": "3 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Bhagwati Prasad Somani",
        "period": "4 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Senthilkumar Mani",
        "period": "4 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Ashwin Kumar",
        "period": "4 months ago",
        "review": ""
    },
    {
        "reviewer_name": "HK",
        "period": "4 months ago",
        "review": ""
    },
    {
        "reviewer_name": "fathisel fathisel",
        "period": "4 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Guru Chandran",
        "period": "5 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Jaya sowndriya Lakshmanan",
        "period": "5 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Foumeer Kassim",
        "period": "5 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Krishnan Venkatraman",
        "period": "5 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Mohan Raj",
        "period": "5 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Baskaran V",
        "period": "5 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Parthiban S",
        "period": "5 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Priya Nedunchezhian",
        "period": "5 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Noorul Aein",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Lavanya Sankar",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Bhavya K",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Banumathi",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Megala Yazhini",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Thiyagarajan Natarajan",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Prakash Ravirathinam",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Vigneshwaran",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "mallai thamizhachi",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "amirtha govindraj",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Devi Priya",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "C.praneash 6-A 6146",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Devasigamany Ramatchindrian",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "shanmugam umakanthan",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "shankar reddy",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Ishu S",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Venugopal kothandaramn",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Rajathi Murthi",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "DR P.VELMURUGAN",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Vishnu priya T.S",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Swatish Swaminathan",
        "period": "6 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Namita Khadloya",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Sabit Zubair Zayn",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Shyam mallan",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Banu Banu",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Gayathree M",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Sathiyendran C",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Vijaya Lakshmi",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "murali krishna",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Ayusman Mohanty",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Subramaniam Somasundaram",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "r.veera Vignesh",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "srinivasan guru",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Veera Jakkammal",
        "period": "7 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Guna Sekar",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Karthi R",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Akshaya B",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Prasanna venkatesh",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Bharathi Sathyaseelan",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Manimaran T",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Robinson T",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Subramanian R",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Balamurugan Ramalingam",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Priya G",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "srini vasan",
        "period": "8 months ago",
        "review": ""
    },
    {
        "reviewer_name": "vijayanand thiagarajan",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Purvaja Ramachandran",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Prithwin Gengadurai",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "shankar karuppiah",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Shilpa",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Hari Ghari",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Moqthar Maddy",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Sabareesh Srinivasan",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "sri. vasanth",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Narayanan Raghavan",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Kadapana Sucharitha",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Bavani Bavani",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Vignesh Kumar",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Pavithraashree J Javed",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "deepa p",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Masanam Masanam",
        "period": "9 months ago",
        "review": ""
    },
    {
        "reviewer_name": "vinothini ganesh",
        "period": "10 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Geetavani v",
        "period": "10 months ago",
        "review": ""
    },
    {
        "reviewer_name": "ponni suresh",
        "period": "10 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Gitanjali Shiva",
        "period": "10 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Francis Johnson",
        "period": "11 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Muthu Lakshmi Naren",
        "period": "11 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Aakash K",
        "period": "11 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Abid Metro",
        "period": "11 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Lakshmi Narayanan",
        "period": "11 months ago",
        "review": ""
    },
    {
        "reviewer_name": "Sreya A",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Venkatesan Pandurangan",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Mohammad Murshith",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "preethi mekhalya",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Bhuvana Venkat",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Stella Alagu",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Prathibha Krishna Kumar",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Tofazzul Hossain",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Yokesh kumar Yokesh kumar",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "sudha ela",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "ronald jackson",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Boobalan G",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "aswin aswin",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Raiden",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Poornajothi Sudhish",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "frontoffice Chennai",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "mohana sundaram.v. OT",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Swetha Sivakumar",
        "period": "a year ago",
        "review": ""
    },
    {
        "reviewer_name": "Magesh mahe",
        "period": "2 years ago",
        "review": ""
    },
    {
        "reviewer_name": "ponsubrya kumar",
        "period": "2 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Raghavi Vikkiramanathan",
        "period": "2 years ago",
        "review": ""
    },
    {
        "reviewer_name": "thowficali",
        "period": "2 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Varun S",
        "period": "2 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Shashank B",
        "period": "2 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Anitha Devaraj",
        "period": "2 years ago",
        "review": ""
    },
    {
        "reviewer_name": "vino bharkavi",
        "period": "2 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Prasanna Vasudevan",
        "period": "2 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Arunkumar Balasubramani",
        "period": "3 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Vasupradha Sriram",
        "period": "3 years ago",
        "review": ""
    },
    {
        "reviewer_name": "gunasekar sangeetha",
        "period": "3 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Saravana Babu Srinivasan",
        "period": "3 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Subhalakshmi V",
        "period": "3 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Mànisha winslet",
        "period": "3 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Swaminathan R",
        "period": "3 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Kishore Vallabhaneni",
        "period": "3 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Adora A",
        "period": "3 years ago",
        "review": ""
    },
    {
        "reviewer_name": "vajram bad",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Dinesh Kumar S",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "K.S.R.Sivarama Krishnan",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Naveena Sajja",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Shree Ram D K",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Venkatasalam Venkatasalam",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Golden- Design expl",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "porchelvi m",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Vijayalakshmi V",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "SAI SANGEETHA",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Rubin Km",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Dewakhar J",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Ajay Eswaran",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "senthil j",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "jyoti gour",
        "period": "4 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Mohamed Umar Anas",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Rakesh Shaw",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Tamilselvi thandapani",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "ajay senthil",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Anbu Inbanathan",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Kayalvizhi meena",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "paul ranjith",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Vishal Sourav",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "subu hunter",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "SAMRAJ KUMAR R",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Kannan Venkat",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Satish Jayachandiran",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Nandy Nayan",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Rajesh Kumar",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Vignesh R",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "arul raja",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Backiyaraj P",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Raja Prakash",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Ruban Don",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Daya Kct",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "PRABHAKARAN K",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Thilaga R",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Saranya Rajesh",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "MAHESWARI D",
        "period": "5 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Shekar Kannaiah",
        "period": "6 years ago",
        "review": ""
    },
    {
        "reviewer_name": "CH.KONDAIAH CHK",
        "period": "6 years ago",
        "review": ""
    },
    {
        "reviewer_name": "bhaala kumaar KA",
        "period": "6 years ago",
        "review": ""
    },
    {
        "reviewer_name": "viji madhu",
        "period": "6 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Vikas C",
        "period": "6 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Sankar Muthusamy",
        "period": "6 years ago",
        "review": ""
    },
    {
        "reviewer_name": "pravin kumar",
        "period": "6 years ago",
        "review": ""
    },
    {
        "reviewer_name": "Krishnamoorthy Natesan",
        "period": "6 years ago",
        "review": ""
    }
]